[
{"reviewer_name": ["Johnny Be Good, ", "Honda Guy, ", "BarryH, ", "SD, ", "Beansy, ", "Paul, ", "DP392, ", "Joel, ", "Mark, ", "JONATHAN, ", "Disappointed, ", "Brian the Particular, ", "Carl, ", "noname, ", "Caity, ", "Sparky, ", "Ray.     612 396 8668, ", "Maintainer.NC, ", "John, ", "MP, "], "reviewer_rating": ["4.4", "4.4", "5", "2", "5", "2", "5", "5", "5", "5", "5", "5", "5", "4", "3", "2", "2", "1", "4", "5", "5", "5", "4", "5", "1", "5"], "reviewer_headline": ["From 501s to Lee Jeans. Best Conversion Ever", "I would buy this product again", "The perfect jeans using the perfect online source", "Lee jeans are my favorite...need slightly higher waistline,", "I will purchase more in the future.", "Great jeans", "Great jeans", "Fit is not consistent.", "Belt straps", "Why do the waist sizes vary?", "Lee Regular Fit Straight Leg Jeans", "not the same jean", "Love product, dislike mobile app", "A big snugger please", "Dad loves them and has worn for years", "My favorite jeans!", "Length", "Great Product - Outstanding Customer Service", "Cut and sizing has changed", "Always reliable."], "reviewer_comment": ["I unfortunately wasn't around during the time when all denim was a heavyweight fabric. Nowadays it seems like most denim retailers sell paper thin denim. And I am not a fan. So for a while I only work 501s. Until I actually decided to examine a pair of Lee Regular Straights. And if you're looking for a jean that is built tough with a heavyweight denim. These are it. I love that they tell you how many oz you're getting in each pair. I love the \"lazy S\" back pocket details and just the overall construction of these jeans.", "All of my jeans have been Lee since college. I always bought them in a local store, but this time it did not have my size. I was overwhelmed by the choices on this site, but was smart enough to look at the stock keeping unit (i.e. item code) in my current jeans.", "Lee jeans fit me perfectly and I needed a few spare pair. After going through about 20 pairs at the store looking for the right shade and size, I through up my arms and just decided to go online. Straight from Lee.com these jeans came in perfect condition and the whole process was easy and quick. Thanks Lee", "These Lee classic cut fit perfect if you are an athletic body type and determine your sizing accurately. Small issue is the waistline need to come up slightly, because if you have any curve to your physique, it barely makes it to the proper waist position. Piggy bank look is now out in 2020 and looks dated, and nothing classic about it. Other than that small gripe these jeans have a great look and fit, hug body perfectly without being too tight, and look especially nice in color Orion. Small adjustment to the waist, (maybe add 1/2 in.) and you nailed the look.", "I have been wearing Lee jeans for many years. I was never able to find size 35\" waist in the stores here, so always had to go with 36\". Now I have found 35 on your website at Lee.com and they fit well, however, it would be nice to be able to get a 29\" leg length, which you do not make (35 - 29).", "I have bought Lee jeans for several years. The two pair that I purchased most recently had noticeably crooked seams. I called customer service, which emailed me a shipping label. The replacement jeans arrived in about a week, and they were perfect. The company really stands behind its products, which is a definite plus.", "I was looking for some new basic jeans, something that would be durable and hold up well. I purchased 4 pairs (different colors) of these Lee Regular Fit Straight Leg Jeans. They fit great, very comfortable and look great. I've used Lee jeans for many years and have never had an issue with their products.", "I don't know if this is a quality control issue or not, but I believe the fit on these jeans are not consistent. My size is 36x29 and I bought three Lee jeans in different colors. Same size, different fits. One was perfect but the other two ended up feeling tight. I kept the hoping they would loosen up a bit, but it's something to consider before purchasing.", "First time wearing them one of my loops that hold a belt in place was torn out. They snagged on a doorknob! Couldn't believe it. I had already washed them so I didn't try to return them. As I teenager or young adult lee jeans lasted forever. Now fabric is too light.", "I buy the same size 32 waist jeans every time, but the last ones I bought I couldn't button. I just bought 33's just recently, and they're way too loose. What gives? Did someone change how long an inch is?", "My husband has worn these jeans for years, but like everything else in our lives, the Corporation has decided to change the fit. These jeans are advertised as fitting at the waist, but this is no longer true. For those that have long waist, these jeans no longer fit like the previous jeans fit. Very disappointed in the new fit and had to return them.", "I have multiple pairs of 'Lee Jeans Regular Fit' that I have purchased in the past. These 'Lee Jeans Regular Fit' are no where near the same quality. The fabric is much cheaper, lighter weight cotton . The length is way off & the overall fit is not the same. Looks like Lee sacrificed quality to increased profit margin. Shame", "Glad i found you guys again...always wore your jeans over others, but was somehow convinced by others that different events call for different styles. Sorry i left. Have absolutely loved all of the jeans i've purchased, and will continue struggling through the less-than-responsive mobile site. That side of your e-biz needs some real work, but the jeans are awesome.", "They are great for what they are, perfect. But, going forward I will look for something that fits a bit tighter in the thighs and butt. I do realize America is spreading in those areas but I can only wear them once before washing because they get a bit baggy. The first time after washing they are perfect. Also, I think if you made this style in a stretch version it would be the perfect jean for me, I could go down a size. Again overall, the three pair I bought are outstanding, and I suspect the fit will get better with age.", "This is my dad's go to pants for everyday activities and when he works outside in the dirt. He's worn them for years and they're long lasting. Great present", "I bought two pairs of blue jeans for my husband because he loves Lee Jeans so much! They fit him perfectly and they are the best in terms of durability!!", "I ordered 2 pair at my normal size 36/34. These Jean's must run long. I guess I should have ordered 36/32. Am I able to exchange? They have been washed once.", "Pepperwash finish is great for my tastes. Love the straight leg cut too. I've been wearing Lee for years now and they've always held up very well. I'll be back for yet another pair...", "I've been wearing this style of jeans for a couple years fit me pretty well on my last order I noticed that they have changed quite a bit, the legs are wider and longer and baggier in the same sizeI have been wearing.", "I have bought these many times. I am female but the men's jeans are better (e.g., 100% cotton). I just bought 2 for me and 2 for my brother, who also likes them"], "reviewed_date": ["July 12, 2018", "March 23, 2020", "February 19, 2020", "January 10, 2020", "January 16, 2020", "February 24, 2020", "November 22, 2019", "March 23, 2020", "January 10, 2020", "March 26, 2020", "September 17, 2019", "November 30, 2019", "October 8, 2019", "November 28, 2019", "January 3, 2020", "December 28, 2019", "December 28, 2019", "January 30, 2020", "January 8, 2020", "December 25, 2019"], "reviewes_likes": ["4", "0", "0", "0", "0", "0", "0", "0", "2", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_tags": [], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]}
]