[
{"reviewer_name": ["Johnny Be Good, ", "Honda Guy, ", "BarryH, ", "SD, ", "Beansy, ", "Paul, ", "DP392, ", "Joel, ", "Mark, ", "JONATHAN, ", "Disappointed, ", "Brian the Particular, ", "Carl, ", "noname, ", "Caity, ", "Sparky, ", "Ray.     612 396 8668, ", "Maintainer.NC, ", "John, ", "MP, "], "reviewer_rating": ["5", "5", "5", "5", "5", "5", "5", "4", "3", "2", "2", "1", "4", "5", "5", "5", "4", "5", "1", "5"], "reviewer_headline": ["From 501s to Lee Jeans. Best Conversion Ever", "I would buy this product again", "The perfect jeans using the perfect online source", "Lee jeans are my favorite...need slightly higher waistline,", "I will purchase more in the future.", "Great jeans", "Great jeans", "Fit is not consistent.", "Belt straps", "Why do the waist sizes vary?", "Lee Regular Fit Straight Leg Jeans", "not the same jean", "Love product, dislike mobile app", "A big snugger please", "Dad loves them and has worn for years", "My favorite jeans!", "Length", "Great Product - Outstanding Customer Service", "Cut and sizing has changed", "Always reliable."], "reviewer_comment": ["I unfortunately wasn't around during the time when all denim was a heavyweight fabric. Nowadays it seems like most denim retailers sell paper thin denim. And I am not a fan. So for a while I only work 501s. Until I actually decided to examine a pair of Lee Regular Straights. And if you're looking for a jean that is built tough with a heavyweight denim. These are it. I love that they tell you how many oz you're getting in each pair. I love the \"lazy S\" back pocket details and just the overall construction of these jeans.", "All of my jeans have been Lee since college. I always bought them in a local store, but this time it did not have my size. I was overwhelmed by the choices on this site, but was smart enough to look at the stock keeping unit (i.e. item code) in my current jeans.", "Lee jeans fit me perfectly and I needed a few spare pair. After going through about 20 pairs at the store looking for the right shade and size, I through up my arms and just decided to go online. Straight from Lee.com these jeans came in perfect condition and the whole process was easy and quick. Thanks Lee", "These Lee classic cut fit perfect if you are an athletic body type and determine your sizing accurately. Small issue is the waistline need to come up slightly, because if you have any curve to your physique, it barely makes it to the proper waist position. Piggy bank look is now out in 2020 and looks dated, and nothing classic about it. Other than that small gripe these jeans have a great look and fit, hug body perfectly without being too tight, and look especially nice in color Orion. Small adjustment to the waist, (maybe add 1/2 in.) and you nailed the look.", "I have been wearing Lee jeans for many years. I was never able to find size 35\" waist in the stores here, so always had to go with 36\". Now I have found 35 on your website at Lee.com and they fit well, however, it would be nice to be able to get a 29\" leg length, which you do not make (35 - 29).", "I have bought Lee jeans for several years. The two pair that I purchased most recently had noticeably crooked seams. I called customer service, which emailed me a shipping label. The replacement jeans arrived in about a week, and they were perfect. The company really stands behind its products, which is a definite plus.", "I was looking for some new basic jeans, something that would be durable and hold up well. I purchased 4 pairs (different colors) of these Lee Regular Fit Straight Leg Jeans. They fit great, very comfortable and look great. I've used Lee jeans for many years and have never had an issue with their products.", "I don't know if this is a quality control issue or not, but I believe the fit on these jeans are not consistent. My size is 36x29 and I bought three Lee jeans in different colors. Same size, different fits. One was perfect but the other two ended up feeling tight. I kept the hoping they would loosen up a bit, but it's something to consider before purchasing.", "First time wearing them one of my loops that hold a belt in place was torn out. They snagged on a doorknob! Couldn't believe it. I had already washed them so I didn't try to return them. As I teenager or young adult lee jeans lasted forever. Now fabric is too light.", "I buy the same size 32 waist jeans every time, but the last ones I bought I couldn't button. I just bought 33's just recently, and they're way too loose. What gives? Did someone change how long an inch is?", "My husband has worn these jeans for years, but like everything else in our lives, the Corporation has decided to change the fit. These jeans are advertised as fitting at the waist, but this is no longer true. For those that have long waist, these jeans no longer fit like the previous jeans fit. Very disappointed in the new fit and had to return them.", "I have multiple pairs of 'Lee Jeans Regular Fit' that I have purchased in the past. These 'Lee Jeans Regular Fit' are no where near the same quality. The fabric is much cheaper, lighter weight cotton . The length is way off & the overall fit is not the same. Looks like Lee sacrificed quality to increased profit margin. Shame", "Glad i found you guys again...always wore your jeans over others, but was somehow convinced by others that different events call for different styles. Sorry i left. Have absolutely loved all of the jeans i've purchased, and will continue struggling through the less-than-responsive mobile site. That side of your e-biz needs some real work, but the jeans are awesome.", "They are great for what they are, perfect. But, going forward I will look for something that fits a bit tighter in the thighs and butt. I do realize America is spreading in those areas but I can only wear them once before washing because they get a bit baggy. The first time after washing they are perfect. Also, I think if you made this style in a stretch version it would be the perfect jean for me, I could go down a size. Again overall, the three pair I bought are outstanding, and I suspect the fit will get better with age.", "This is my dad's go to pants for everyday activities and when he works outside in the dirt. He's worn them for years and they're long lasting. Great present", "I bought two pairs of blue jeans for my husband because he loves Lee Jeans so much! They fit him perfectly and they are the best in terms of durability!!", "I ordered 2 pair at my normal size 36/34. These Jean's must run long. I guess I should have ordered 36/32. Am I able to exchange? They have been washed once.", "Pepperwash finish is great for my tastes. Love the straight leg cut too. I've been wearing Lee for years now and they've always held up very well. I'll be back for yet another pair...", "I've been wearing this style of jeans for a couple years fit me pretty well on my last order I noticed that they have changed quite a bit, the legs are wider and longer and baggier in the same sizeI have been wearing.", "I have bought these many times. I am female but the men's jeans are better (e.g., 100% cotton). I just bought 2 for me and 2 for my brother, who also likes them"], "reviewed_date": ["July 12, 2018", "March 23, 2020", "February 19, 2020", "January 10, 2020", "January 16, 2020", "February 24, 2020", "November 22, 2019", "March 23, 2020", "January 10, 2020", "March 26, 2020", "September 17, 2019", "November 30, 2019", "October 8, 2019", "November 28, 2019", "January 3, 2020", "December 28, 2019", "December 28, 2019", "January 30, 2020", "January 8, 2020", "December 25, 2019"], "reviewes_likes": ["4", "0", "0", "0", "0", "0", "0", "0", "2", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Mike, ", "K the Dog, ", "Ronald, ", "Grump, ", "Daisymae, ", "scott1, ", "robert, ", "Burt Fan, ", "Bruce, ", "Don, ", "Jack, ", "boomer, ", "RJ62, ", "Happy Camper, ", "Fixmymri, ", "Bob the thinker, ", "Jeck, ", "LKS, ", "Rob, ", "tex, "], "reviewer_rating": ["4", "5", "5", "5", "5", "4", "3", "5", "5", "3", "5", "5", "4", "5", "5", "4", "4", "5", "5", "4"], "reviewer_headline": ["Just what I was looking for", "Lee never fails me!", "Great", "44+ Years in Lee Jeans", "I would buy these jeans again and again.", "The stores that used to carry Lee Jeans", "I hope I'm not stuck buying these in the future", "Husband's Regular Straight Fit Jeans", "Jeans Purchase", "Lee", "Great Jean's, and price", "rethink Lee", "Size error", "Will purchase again.", "I ordered the wrong size and...", "Will keep buying these jeansq", "Classic jeans", "No More Levis For Me.", "Old Fashioned Jeans", "review comments"], "reviewer_comment": ["I hate shopping. The store never seems to have my size or color. I chose to order online and the regular fit straight leg jeans fit as expected. I just wish a shorter inseam was available. Yea, I AM that short!", "Lee always provides me with the right fit, style, and color selections. I highly recommend Lee jeans. I have owned many, many pairs. Never once have I complained.", "Too bad you can't find these in the stores anymore. This Lee website is the only one that shows accurate colors AND denim weight. Runs circles around Levi's, which I wore for decades but are now no longer sewn properly.", "It has always been the only choice for me. Lee comes out on top in every category jeans can be judged by me. Always without fail; quality, consistency in fit and wear, long lasting and tough. So happy this has been one of the constants in such a changing world where quality takes a second seat. Thank you so much.", "Lee jeans are the best. My husband is a truckdriver so his jeans have to be comfortable but not loose so they don't cause a hazard and hold their color so he can wear them for other things. Lee always fit the bill. He's worn Lee jeans since I've known him and thats 39 years. I like them because they look good on him and they last forever. Good job!!", "I've been in all the stores that used to carry Lee Jeans and could not find my replacement Jeans. Looked at the tags in my Jeans and found the Lee model number so I knew I was going to get the exact product I wanted...and...thats what I ordered and got this last time. Thanks Lee Jeans!", "I have worn Lee regular fit jeans for decades and had loved them, but the latest ones I recently purchased disappoint me. I ordered them on line and immediately noticed they were way too loose in the waste. I returned them and ordered a few pairs in different sizes. They're \"okay\" but stretch out a bit while wearing them. I miss the previous way they were made, without so much stretch. Since I received them I've been searching everywhere for different brand of jeans that look similar but aren't stretchy like women's jeans. Also I like them in light blue and the only place I can find them in that color is on line.", "The regular straight fit jeans that I purchased for my husband fit him perfectly. He told me that they are very comfortable to wear, made well and that the denim is a good all year weight. The jeans have been washed a few times since purchase and come out of the dryer looking great.", "I love my Lee jeans! Been buying and wearing Lee jeans for 60 years.", "One pair arrived with a tear in the leg. I do not have the return label and it is a major hassle to return one pair.", "I really like this particular style in the Wylie color, and keep buying them. They are softer than the other normal blue jeans, I don't know why.", "I think I stopped buying Lee over price years ago , but now you can't beat them for what you get ! It's like visiting an old friend, thanks Lee", "I purchased these jeans for my husband from the product ID number on some old ones he had and loved. They did not disappoint. He loved the fit.", "I'll purchase again. When these wear out. Which means it will be a while before I do. Sorry, Lee!", "Long time Lee customer. Excellent quality.", "Wear for casual purposes. Only negative is sometimes the shades are A bit different but has not been a deal breaker.", "Don't quit making this style of jeans! My husband has only worn this style for 30 years. Perfect jeans for him.", "I liked them well enough to buy 10 pair in about 4 mos. You made them very affordable for someone on a fixed income.", "Fit the same as they always have, with the same quality of materials. While most brands have changed sizing, fabric, look, etc, these are unchanged--heavy duty denim, traditional fit, nice. Don't change please!", "would like to see 35\" waist size offered as 34 is tight and 36 is a little loose, but 36 is what I have always bought. like lee's, have bought many years. zipper size seems shorter than before? would like a longer zipper for safety."], "reviewed_date": ["November 28, 2019", "October 29, 2019", "October 31, 2019", "June 14, 2019", "June 12, 2019", "June 11, 2019", "May 5, 2019", "July 9, 2019", "April 3, 2020", "January 29, 2020", "January 29, 2020", "February 1, 2020", "January 22, 2020", "March 21, 2020", "March 14, 2020", "September 8, 2019", "November 20, 2019", "December 23, 2019", "July 11, 2019", "June 7, 2019"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["John, ", "Pete, ", "Franco the Designer, ", "Triumphguy, ", "N/A, ", "Marilyn, ", "Dedee, ", "richard, ", "Joe, ", "RussMan, ", "Wolfman, ", "Mike, ", "Skip, ", "Bobout, ", "stewj21, ", "Alan, ", "Big Gary, ", "Timmck41, ", "M .R, ", "Grandad, "], "reviewer_rating": ["5", "5", "5", "5", "5", "5", "5", "4", "5", "5", "5", "5", "5", "5", "5", "5", "5", "4", "5", "4"], "reviewer_headline": ["My favorite black jeans", "100% cotton jeans", "I would buy this product again", "I have 8 pair and love them.", "Repeat customer", "I would buy this product again and again", "My favorite Jeans", "I will buy product again", "Yes, I would like to stay with the Lee products", "I have worn these jeans for many years.", "These are actually my husbands 2nd pair", "Perfect!", "I will buy these pants again", "Yes", "Nice Jeans, good price", "I would buy this product again", "great jeans!", "Just what I wanted", "loves Lee Jeans", "I would buy this product again"], "reviewer_comment": ["These last a long time, yes the color like all jeans eventual fades, yet I have found these black jeans last the longest for wear and for their color integrity", "Many more colors available online than at the mall. When choosing a size understand that Size and waist as measured through the belt loops are not the same.", "I would buy this product again", "Nice fit, casual look, wear well.", "Can look casual dressy or feel comfortable on a hike", "Mens pants for casual use", "Greatest pair of jeans I ever bought. Great with sports coat.", "the jeans work for my needs, better than most for a decent price", "I am retired and like comfort as well as style.", "I wear only these jeans, the all events, weddings, work, etc. I am a Lee Jeans man.", "My husband loves these jeans. They fit him great and he likes the slight stretch fit.", "Exact fit on the length! Feels good and looks great.", "Nice looking and comfortable to wear and being a senior that's what it's all about.", "These are Lee Jeans They fit right and last a long time.", "These fit well and look as good, or better, than the much overpriced competitor.", "I wear to work daily and am very satisfied.", "Perfect fit,very comfortable, good, heavy denim. look great! What more do you want?", "Perfect in fit and material.", "My husband loves Lee Jeans they just fit imperfect", "Quality material that lasts!"], "reviewed_date": ["July 18, 2019", "June 15, 2019", "February 8, 2020", "December 28, 2019", "January 15, 2020", "February 5, 2020", "January 10, 2020", "February 22, 2020", "January 13, 2020", "February 19, 2020", "January 24, 2020", "October 1, 2019", "October 18, 2019", "December 24, 2019", "December 24, 2019", "November 20, 2019", "September 11, 2019", "December 27, 2019", "November 8, 2019", "November 28, 2019"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Sandra, ", "Mark, ", "Wattsy, ", "Jean guy, ", "Kenny, ", "neal, ", "Teh, ", "Dan, ", "Walt, ", "Ooooooooooo, ", "Don, ", "Kaptnkirk, ", "Tom, ", "T, ", "eric the bold, ", "Conni, ", "K425, ", "New Carharttt customer, ", "Just a Man That Likes Jeans, ", "Dano, "], "reviewer_rating": ["5", "5", "4", "5", "5", "5", "5", "5", "5", "5", "3", "5", "4", "2", "4", "5", "5", "1", "1", "5"], "reviewer_headline": ["Lee Relaxed Fit Jeans", "Very satisfied with this product. I'll purchase again.", "Solid choice", "Just nice jeans.", "yes", "would only use 1 or 2 \"agains\" only wear 1 pair at a time", "Great fit, comfort, appearance", "My Jeans", "I would buy this product again", "Yes I will", "NO", "Been buying this product for years", "I have been buying this for years", "Inconsistent sizing", "I HAVE!", "My husband loves these Lee jeans. He wares only Lees.", "The length is perfect!A 29 length is hard to find", "Baggy jeans", "Disappointed", "Great Pair of Jeans"], "reviewer_comment": ["My husband loves his new jeans -- they fit perfectly. I loved the great price and free shipping!", "Very happy with my purchase. Fit well and very comfortable", "I got a unique color and like it. Great price...Lee jeans fit me well", "These are the only style I buy anymore. Fit nice. Look good.", "Wear them every day. They wear well and last longer than other jeans.", "Great fit especially around seat area! Would make rear pocket(s) slightly deeper!", "I wear with a dress shirt to work.", "Perfect fit and size. Been buying the same size and style for as long as I can remember. Thanks Dan", "Really like the fit and comfort.", "Would like to see 28 inch inseam", "Wrong rise.", "Been buying this style mean for years..unfortunately the stores seem to only carry the stretch type jean. So I buy them from Lee online.", "My only problem is I can never find my size (W 31 L 29) in stores. Now it seemsw that Lee.com is having trouble stocking it as well.", "I bought two pairs of Jean'sand one fit great. The other, same size, I can barely button and certainly can't wear.", "everyday!", "He loves Lee Jeans!", "The jeans are wonderful", "I've been buying the same jeans for ever. The last 3 pair I purchased fit in the waist and length, but the rear and the legs look like they were sized for much larger jeans. Describing them as baggy is an under statement. I have found another brand that fit and I will not be buying these again. Lee's quality control is not what it used to be. I would not recommend these to anyone who is average sized. If you are on the larger size... husky... then maybe these are for you.", "I ordered 3 pairs of the same style and same size jean. Extremely disappointed when each pair was cut differently in both length and leg width. I had to take them to a local tailor to shorten inseam and taper the legs to get a uniform fit. When you order the same size and style you would think they would ALL fit the same. Sadly that was not the case. Have no idea where you have outsourced the sewing of this product, but they are lacking in quality control regarding size.", "I buy Lee's because they fit right and last a long time. When I buy jeans, I want good quality that doesn't wear easy. I may not be as active as I used to be, but I can still put some wear into a pair! Lee's hold up ... period. They fit really well too ... I only wish they had a 31 length. 30 is too short and 32 is a tiny bit long. Otherwise, great product and priced right."], "reviewed_date": ["December 13, 2019", "October 9, 2019", "December 25, 2019", "December 26, 2019", "October 19, 2019", "November 28, 2019", "December 15, 2019", "November 7, 2019", "December 17, 2019", "September 10, 2019", "March 18, 2020", "August 16, 2019", "July 4, 2019", "June 21, 2019", "December 29, 2019", "January 7, 2020", "December 28, 2019", "April 15, 2019", "July 15, 2018", "October 2, 2018"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Gary, ", "WT, ", "Eric, ", "Brodie, ", "Marky, ", "Wes, ", "Blackbird, ", "Nathaniel, ", "Forever Young, ", "Doug, ", "Laurie, ", "Teachermomva, ", "Staci, ", "Pearl2018, ", "JohnI, ", "Bert, ", "Schef Schaf, ", "Brett, ", "Farmboy, ", "Hydro, "], "reviewer_rating": ["5", "5", "5", "4", "5", "5", "4", "4", "5", "2", "5", "5", "5", "5", "5", "5", "5", "5", "5", "4"], "reviewer_headline": ["Good Jean for Price and Quality", "regular-fit-straight-leg-jean", "Perfect fit, great quality.", "Almost but not quite", "Great looking jeans!", "The only jeans for me!", "Great Jeans-great value", "Fav jeans brand but brown pair not perfect. B+", "Classic Jean, great fit, excellent quality and value!", "Sizing Questionable", "Lee Jeans", "Quality jeans and excellent price", "Happy Girl!", "The Perfect Jean", "The best jeans I've ever owned!", "They fit!", "No hassle", "My new favorite jeans", "Just What I wanted", "I would buy this product again"], "reviewer_comment": ["Own 5 pair of the Lee Regular Fit Straight Leg Jean and 2 of the Boot Cut. Like that they don't ride low on the hip but fit nicely at the waist. They are not tight or loose in the rise which is hard to find in jeans today. Length ends up perfect after one washing. Good quality especially for the price.", "Lee jeans fit perfect the right size at least for me true size been wearing Lee jeans for many many years they last a long time uses are foe work and casuals wear remember and still have a pair that still has the leather Lee tag in back still wears it its old like me almost I would recommend Lee Jeans to Antoine who wants to spend thier money on quality Jeans at a fair price Thanks Lee Jean for great wear all these years", "I'll definitely buy these jeans again, and only from Lee.com! Every time I buy from the major department stores online, I always get jeans that are made too big in the waist and too long in length. The same thing happens when I buy online from Lee's main competitor. Always. And, the material is thin. I've bought Lee jeans at two different times and they all fit perfect!", "I have Lee and Levi jeans that are ten years old and older. The value came in the quality of the material, finish and they lasted for ever. While the finish is much the same today, both companies have moved to a product with lighter weight denim. Unfortunately, I expect that the life of my new jeans will be significantly shorter than my past experience. Overall I rate my Lee jeans as Good rather than Excellent for the reasons noted in this review.", "I love Lee Jeans , especially the regular fit straight leg jeans. I have worn other top brands And they do not fit as well or look as good. These jeans even make me look slimmer, and at 58 years old,that is important. Ordering on Lee's website is convenient and easy . Jeans arrive quickly and packaged Beautifully. Love my Lee's!!!", "Regular Fit Straight Leg Jeans are the only look and feel of \"real jeans\". Recently lost weight and had to rebuy 3 pairs with smaller waist. Six weeks later, I had to do it again!! Couldn't find 32x29 at my local store, so ordered them directly from the source. These are the only jeans for me. Much better than Levi... just saying.", "I love the fit and the look. two minor complaints are the double black seem to fade too quickly and I wish they were pre-shrunk although, by my measurement the length comes about three quarters to one inch longer than ordered and shrink in a hot dryer about that much so it works out. But, try these jeans, you won't be returning them which, by the way, they make very easy to do with a return label.", "I love Lee jeans for fit, comfort and durability and price. The blue ones always look great too. This brown pair is okay, but after one wash they got lines of discoloration. The grey pair that I bought last year did the same thing. The color bleeds and the jeans come out of wash with a permanent wrinkled look even though the dryer takes the actual wrinkles out, the color bleed makes the wrinkles look permanent. I think I'll wash my next pair of colored Lee jeans by hand for their first wash and air dry. After that I bet they'd wash fine.", "I am 6' tall with a medium athletic build. I have long legs and a naturally high waist. I have been wearing Lee jeans since I was in junior high school and they continue to fit me well. They are durable and have a classic style for a clean, dressy casual look that goes well with a variety of year-round combinations of shoes and tops, like polos in the Spring/Summer and mock necks/sweaters in the Fall/Winter. Unbelievably, people on the street, in my office and at get-togethers marvel at them, asking me \"what type of jeans are those?\" or \"where did you get them?\". When I tell them they are Lee jeans that have been made in America for over 100 years, and they are available at many Army-Navys and department stores, they are dumbfounded! I also refer them to Lee's website and reinforce the overall value, especially now that many people have been brainwashed into paying anywhere from double the price to hundreds of dollars for \"trendy\" jeans, including frayed jeans with holes and baggy, low-hanging jeans for the \"prison look\".", "I have purchased many pairs of Lee jeans over the years and the sizing has always been consistent. With this last purchase (waist size 38) these seemed incredibly tight versus previous pairs. Because of the previous success in sizing I went ahead and washed this pair prior to trying them on (my mistake). Would probably not buy online again due to not being able to try the fit before buying.", "My husband loves these jeans and we hope that u will always continue to make them. He has been wearing them for years. Department stores do not carry all of the colors (or they are always sold out),and length 29 is hard to find as well. This is why I like to order them straight from the Lee website. Great variety and perfect size. Thanks Lee Jeans!", "Bought these jeans in several colors for my son. I like that Lee offers so many color options and sizes, esp for tall (length 36) and waist measurements. Often you cannot find jeans in tall sizes with slim waist. Love the options of slim, relaxed, fits.", "I bought 3 pair of these for myself in dark wash, gray and beige. I am 6 feet tall and need a 36 inch inseam. I have narrow hips so I love the straight cut. It's hard to find that length in the small waist sizes at the stores. Perfect fit, great quality and good price. Of course they look quite different on my figure than on that male model!! Trust me ladies, don't be afraid if you need that length.", "My husband wears a 35\"x32\" and has very skinny legs. He also will not purchase anything with \"stretch\". So, this is it. The 35\" waist is hard to find in stores but I love that we can order online and take advantage of sales and free shipping from time to time.", "I was wandering in the wilderness for years, never happy with the jeans I was buying. And I tried them all. Except I didn't try Lee. Don't as me why...I just didn't. Now I have and I've never been happier. The fit of this model is perfect for me...from the waist to the ankle and everywhere in between. And the weight and quality of the denim and the workmanship is the best I've encountered. I immediately bought three pair just in case the world came to an end and I could get them again.", "Although I felt the price was high for someone on a fixed income, I purchased 2 pair of these jeans. They are comfortable and easy care as they do not need to be pressed if taken out of dryer before completely dry and hung on a hanger. If they are as durable as they seem to be, I will consider the purchase as money well spent.", "I have a pair of Lee jeans that I really like, but could not find them in stores and when I did, they did not have my size. Buying through Lee.com I got exactly what I wanted without having to drive around and they came directly to my door within a very short time. I feel very smart.", "After putting up with diminishing quality and fit issues with my previous go-to jeans (Levi's 505) for many years, I decided to give these Lee's a try. I was immediately impressed with the quality of the denim. Nice heavy weight material, and they look and fit great! Just like old times. I'll be back for more.", "I have worn Lee jeans for years and have been unable to find them in the stores. I was very pleased when I found them online. The fit is perfect, the price was very reasonable and they arrived within a very few days. I will definitely recommend Lee jeans and will buy again when the need arises.", "This is spec'd as 14.75oz denim, which appears to the heaviest denim available from Lee. These jeans seem slightly lighter weight compared to previous jeans of the same exact style number and size. Still seem a very good quality product and I would buy again."], "reviewed_date": ["January 16, 2019", "August 22, 2018", "April 29, 2017", "November 9, 2018", "December 26, 2018", "July 14, 2018", "January 8, 2019", "November 25, 2018", "December 1, 2016", "December 3, 2018", "December 13, 2018", "February 4, 2017", "January 5, 2019", "November 27, 2018", "April 9, 2019", "April 25, 2019", "November 27, 2018", "December 22, 2018", "March 17, 2019", "November 28, 2018"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Danny F, ", "Ernie, ", "Tractor Man, ", "Jim, ", "Rob, ", "Lee the shopper, ", "Ray, ", "Wayne, ", "Housewife, ", "don, ", "trucker, ", "AJ, ", "Tonyboy, ", "charlie, ", "nb, ", "Nat, ", "Bull, ", "Happy, ", "Ken, ", "Mens, "], "reviewer_rating": ["4", "5", "5", "4", "3", "5", "5", "5", "5", "5", "5", "5", "5", "5", "1", "5", "5", "5", "4", "5"], "reviewer_headline": ["Variable Waist Size", "I have ordered more", "Most Comfortable Jeans", "Second order in a sort time", "Would not purchase again", "We will be buying these jeans again and again.", "As always", "Great fit", "I am ordering again now.", "Lee jeans are the best.", "yes I would buy again", "I will buy my next pair", "Great jeans", "just what i was looking for", "Yes", "Good Fit", "I love em been buyn em for 30 years", "Would buy again", "Perfect fit for my not so big bum abd skinny legs", "Great jeans"], "reviewer_comment": ["The waist size varies by color! My waist size can vary from a 33\" to a 35\" depending on the color of the same style pant! And the waist size can vary depending on when ordered. My weight has been virtually the same, within 3 pounds, for the past 10 years. It's very frustrating, but once I get the right size, love the jeans! Sometimes have to ship back and forth to find the right size.", "I had forgotten how great these jeans are! They are the best fitting jeans I ever owned. The quality is obvious as soon as you open the package, no cheap fabrics or construction. The many color choices assure you of the exact look you want and the price compared to other brands is nothing short of a steal. I will never pay for over priced jeans again!", "I have worn a lot of different jeans in my lifetime and these are by far the most comfortable ones. They have a little stretch to them but not to the point that they get too stretched out. I have 5 pairs and wear them to work everyday. I do a lot of moving, bending and stepping up on things at my job and these jeans have a little extra give which I like.", "Like Lee jeans very much fit nice waiting to see how they wear. Use to buy these years ago and they held up very well so expecting the same. only one thing I might gripe about would be the zipper, not being long enough. That makes things a bit difficult when you are in a rush.", "Size and fit has changed over the last couple of years for the exact same style.", "Great jeans, great value and great selection. The only jeans my husband will wear!", "I order from Lee a lot and i have never been disappointed with the quality or selection.", "The perfect fit for me...better than Levi's.", "Good quality. Ordering now.", "It's hard to find Lee jeans in a 36/29 in a department store, so ordering on line worked for me.", "wear daily for pleasure and work order was delivered", "Every day jeans comfy soft", "Have a few pair of these in different colors, I wear them every chance I get.", "Jeans for short legs 29 inch inseam and a variety of colors that wanted", "The front pockets should not be sewn into the outer seam. When I sit down my change falls out.", "Exactly as expected. Happy with product.", "Lee jeans has always been that best", "Perfect fit.", "Looking to buy more", "Great fit."], "reviewed_date": ["February 15, 2019", "August 12, 2018", "January 2, 2019", "November 30, 2018", "July 12, 2019", "August 20, 2019", "June 6, 2019", "August 18, 2019", "May 16, 2019", "July 11, 2019", "July 5, 2019", "May 14, 2019", "May 5, 2019", "June 14, 2019", "May 30, 2019", "August 25, 2019", "June 4, 2019", "December 27, 2019", "September 2, 2019", "September 17, 2019"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Score, ", "NotaZ28, ", "Jim, ", "Aloha, ", "John, ", "Mark, ", "Bob, ", "Goatman, ", "Mick, ", "John, ", "Bigal, ", "john, ", "Jerry P, ", "Rick, ", "GP, ", "bluejay, ", "Bj, ", "White Buffalo, ", "Engineer, ", "George, "], "reviewer_rating": ["5", "5", "5", "5", "3", "4", "2", "5", "4", "5", "5", "5", "5", "5", "2", "5", "4", "5", "5", "5"], "reviewer_headline": ["Everything was great", "Goodby Levi's. I Won't Miss You.", "Delivery as described", "Great Jeans", "Quality issues", "Product is fair; not as good as USA or Canada made", "No", "The Only Jeans For Me", "I plan to buy more Lee Products", "Lee jeans - the best!!", "Great jeans, great fit", "First direct order", "Good jeans. I have several pair.", "Survey Review", "I dont think i wou.d buy again", "A great fit", "Need Petite for Men", "Everything I want in a pair of jeans", "Older Man", "An ole friend."], "reviewer_comment": ["Nice fitting jeans", "Everyday Wear.", "Everyday jeans I wear", "They fit right, look right and are simply quite comfortable. I chose a light brown color jean that works well with a plaid western style shirt.", "Generall good product, but need to spend a great deal of time trimming off thread snd excess material that should have been removed at the factory.", "Fit and finish are different from one pair to the other, even though the product number is the same. Not as good as USA or Canada made and have been wearing them for 40 years. They should also bring back the Lee Storm Rider Jacket.", "Color ok. But the length was not 29in. More like 30 ins. The material is different then it use to be My older lee jeans were a a better fix and the material was better", "I've been wearing Lee jeans for as long as I can remember. The fit and quality is better than all the rest. I'm 64 years old and will continue to wear these jeans until I no longer can.", "These are great Jeans for everyday wear. I have worn Levis forever and could never get the fit that I wanted anymore. Lee fit exactly as advertised and and are comfortable and seem to be as durable as the other brands.", "Great fit, highest quality denim and construction, and superb value! Have tried many jeans brands over the years - Lee jeans tower over its competition!!", "I have been wearing Lee for years because I found the fit to be perfect for the average person. I am not a teen or a skinny cowboy, and Lee makes jeans that fir!", "I cannot find my exact size nor style at retail so I ordered direct and got exactly what I need without the hassle. Paid a bit more, but got two day service and it was well worth it.", "I will say I have worn Lee jeans for years, but this is the first time I have ordered them direct. I have always been happy with Lee jeans, they fit me better than any other brand I have tried.", "The Jean's were a lighter weight than I expected. More of a summer weight. I work outside and wanted a heavier weight Jean. Other than the weight of the material everything was good.", "Very thin material, I think a little long for the size 38x30. Too wide at the bottom. I like fit at waist a little slim at butt and smaller openni g at ankle.too wide at bottom.", "Somehow Lee jeans have always fit me well while other brands seem to sag in the seat giving an objectional sloppy look. I wish suspender buttons were an option.", "Someone needs to make petite jeans for men as not all men have long legs. I bought the 29 \" which was still to long and its a good thing I'm a semesters also because I had to shorten them 3\".", "So nice to buy jeans with a waist in 1 inch increments. These fit as well or better than my Levi's, similar quality and nearly half the price. Great jeans", "I am an older man who just wants a good pair of jeans, I don't want them tight, I don't want them around my butt, and I don't want them in tatters. These fits, looks and acts perfect.", "I have been wearing this jean for more years than I care to admit. They always fit. I never even try them on till I get home or I just have them shipped to me. I will wear them as long as they make them."], "reviewed_date": ["September 13, 2019", "October 12, 2019", "November 25, 2019", "October 14, 2009", "October 4, 2017", "December 11, 2018", "June 21, 2017", "February 3, 2019", "May 22, 2017", "February 3, 2019", "October 31, 2018", "December 19, 2016", "January 7, 2019", "January 6, 2019", "September 15, 2018", "June 11, 2018", "November 11, 2018", "November 7, 2018", "January 14, 2019", "December 20, 2018"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Mag, ", "Randy the salesman, ", "Slim Larry, ", "Joet, ", "Forever Customer!, ", "6blackdogsmom, ", "Bowhunter, ", "DT, ", "None, ", "Ody, ", "Frank, ", "Kevin Shane, ", "Robert, ", "Don, ", "D, ", "Wade, the PhD of Piddlin', ", "Popeye, ", "Hunter0851, ", "Happy Customer, ", "Drgarr, "], "reviewer_rating": ["5", "4", "5", "5", "5", "5", "5", "5", "5", "5", "2", "5", "4", "5", "5", "5", "3", "5", "5", "5"], "reviewer_headline": ["Consistent performance", "I will buy from here over and over.", "Perfect for what I was looking for.", "Great Jeans", "I think writing Happy,Happy,Happy about covers it.!", "I finally found my husband's favorite jeans!", "Men's jeans", "Perefect product and style fo me.", "This brand and cut fit my husband very well!", "I LOVE these pants!", "Sizing is off", "Like the weight (medium material) of this particular color", "Bought many times", "Great lightweight jean...many color options", "I will buy these jeans again", "Great jeans, perfect fit", "Average Jeans", "I only wear lee", "Great Jeans", "Lee for me"], "reviewer_comment": ["Size and quality keeps enduring. These pants fit and look as great as the ones I bought 5 or 6 years ago. Will keep buying until Lee changes something up(which I hope will never happen!).", "I was so very pleased to purchase from this site. My husband had \"one\" pair of this style and couldn't find any more. After ordering and receiving the jeans from this site, his Good jeans will always come from here.", "I am tall and thin and have difficulty finding pants that fit properly. These are one of the few pants I have put on and found the fit to be perfect. After purchasing one pair, I immediately purchased four more. Please don't ever change these pants.", "The first pair I got was not the style I expected, so I called and they gladly exchanged them and sent me another pair in the style I wanted with free shipping. These jeans fit perfectly and the price is unbeatable.", "Happy with the Fit, Price, and Free Shipping. Excellent Customer Service. One pair was marked the right size but it was to small and called up and had a new pair in a couple of days. I will always buy my jeans direct from Lee from now on.", "My husband is very picky about his Jean's and now I know just where to get them. The style, cut and color of these Jean's are hard to find in stores because they always sell out.", "Great fit-good quality", "Every day wear.", "Will definitely re-order", "I hate shopping, it's the worst thing ever! Went into a local store in Vermont, intending to look at Carhartt, and left with 2 pair of these. I work with dump trucks and construction, and I prefer men's pants for work, but I don't feel like my lack of appendage is leaving a huge gap like other brands and cuts do. The last pants I bought were a different brand and didn't last 3 months! I foresee these lasting years! I've never been so happy with a pair of pants in my life! They fit wonderfully and comfortably, that I find myself wearing them on the weekend even!", "I ordered three pairs of the straight fit jean based on an existing pair I have that have that \"perfect\" fit. I've only worn one pair so far but found they fit tighter than my existing pair and the leg sizing is off. The right leg is about 1/2-3/4 of an inch shorter than the left leg. While this may not seam like much it does make a difference. Will see how the others fit.", "Medium Weight Material is for me, coming from years of wearing nothing but khaki style. I would rarely wear my old \"heavy\" jeans (one pair just for really cold days) and switched many years ago. NOW, I want to switch to jeans with many colors in this weight. Wish all the colors had this weight as a preference.", "Have purchased this product for several years. Fits well (40W 29L), durable, good color selection, although a light green would be nice.", "Great fit 6 ft 170...bought 31/32 Would be nice if waist was a little flexible But long enough even after washing", "I wear the jeans everyday I am pleased with the quality of the jeans and the customer service as well", "I've worn Lee straight leg jeans for years. Love the way the fit and wear. Last years for casual and work wear.", "They fit fine and are well made, however, I would like a heavier material. I don't think they will hold up to a hard work day for very long.", "I buy Lee jeans exclusively since the 70's. The fit is always good and they last a long time. What else do you need?", "Have been wearing Lee jeans for a lot of years..always the best fit and wearability is why I wear them!!", "I have purchased Lee regular fit straight leg jeans for years because they fit better than any other brand."], "reviewed_date": ["December 22, 2018", "October 17, 2016", "March 28, 2019", "March 27, 2019", "February 27, 2019", "January 12, 2019", "May 2, 2019", "August 27, 2019", "July 9, 2019", "November 16, 2019", "December 13, 2019", "October 19, 2019", "March 27, 2019", "December 18, 2018", "December 21, 2018", "April 6, 2019", "April 10, 2019", "July 8, 2018", "January 11, 2019", "September 17, 2018"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Red, ", "JB, ", "Frank, ", "Sonny Days, ", "mick, ", "Dan, ", "The Town Crier, ", "Steve, ", "Rick, ", "Nathan, ", "Mahi, ", "Maribel, ", "RONALD, ", "Allen, ", "Jerry the outdoorsman, ", "Lee Jeans, ", "Preacher23, ", "Gene, ", "CK, ", "Duane, "], "reviewer_rating": ["4", "5", "4", "5", "1", "1", "5", "5", "4", "1", "1", "5", "5", "3", "5", "5", "5", "5", "5", "5"], "reviewer_headline": ["Lee changed the leg fit and it no longer works for me.", "50 years buying this product", "Best fit I've had.", "Great price, great selection!", "didnt fit right", "Poor quality control", "Great Fit! Great Buy!", "Best fit I have found", "Try them again", "Lee changed the jeans and didn't tell anyone", "Inconsistent fitting", "I would buy this product over and over again.", "i would buy this agine.", "Lee jeans", "Forever Lee Jeans customer", "Buying on line", "Superior to Levis", "Thanks to Mike Rowe \"Dirty Jobs\" a few years ago.", "Best overall", "Future purchases here - 33/29 are impossible to find"], "reviewer_comment": ["The leg and bottom of the straight leg was changed and us now too baggy with no good replacement. Very disappointing.", "I have been wearing Lee jeans since my college days and that was 50 years ago. Now as then the product fits perfectly and is an exceptional value.", "Wear them everyday for almost all occasions. Only drawback is they run a little long. This may change with multiple washings.", "Website was easy to navigate, all sizes available were shown, checkout was easy and delivery was not only free but quick.", "been buying the same size for years and the new ones did not fit at all . to long and to big in the thigh.", "One leg of the jeans was at least an inch longer than the other. They looked silly on me and I threw them out.", "I'm very pleased with my purchase. I would recommend them to family and friends. In fact, I'm wearing a pair as of this review!", "I have tried lots of jeans and found that lee jeans fit the best. Only Jean I have found with a 29 inch inseam. Keep up the good work.", "I have not purchased LEE jeans in several years. Surprised they are really nice looking and fitting.", "I don't know what the heck happened to Lee - Straight Leg - Regular Fit - Men's Jeans, but I'll need that answer before I ever buy another pair. I have three pairs of the jeans mentioned above, and have had them for about three years, and thought these were the last jeans I would EVER buy. They used to fit perfectly to my shape in the waist, legs, and seat. Now, the material seems to fit differently in those areas. I used to be a great customer and very satisfied with lee jeans, but I will have to look for a new company because Lee has completely lost my trust, and from the looks of this same type of review popping up on many different platforms, the trust of many of their FORMER customers. I could understand if Lee wanted to add a new style to their line to appeal to different buyers, but those of us that already felt comfortable with a trusted product should not have had that product changed without notice. This move truly shows how Lee feels about it's customers. BRING BACK THE OLD JEANS!!! p.s. I am 29 years old and this is not a rant that older people sometimes make about how things were better when they were younger. Things were better when Lee didn't mess up their jeans. p.p.s. There is a small tell between the Older version of reliable jeans, and the terrible new one. The older version has a Lee logo stitched near the right front pocket and no logo on the back pocket. The new, changed, and less desirable jeans have no Lee logo on the right front pocket and instead the logo has been placed on the left side of the upper seam of the rear right pocket. If you have a logo on the right backside pocket, your in for a disappointing product.", "I ordered a pair of jeans (Regular fit, Straight leg) but each one has a different fitting. One was almost tight and the other one was very loose and short in length. Poor quality check. I used to order two jeans every year, though this one I ordered it a year ago and just tried it today for first time, it was total disaster and never expected it from Lee. For that matter the pairs I have ordered year by year have different fittings even though I order the same size, model. Fingers crossed I have ordered another pair now and waiting for it to be delivered. If fitting quality is bad, it's good bye to Lee from me. Inconsistent fitting, very bad.", "I purchased for my husband who is very particle with his clothes.", "They fit good and a good price.", "They fit good after washing but they stretch out after wearing.", "I have been buying Lee Jeans for many years. They are perfect for me. I will always be a customer.", "I wear the product and it looks nice", "Lee has a equal to better fit than Levis. The material Lee uses is far superior to Levis.", "Wearing for relaxing and work. Solid. Thanks.", "After 35 years, still wear Lee jeans. Other brands don't compare.", "Size is very comfortable - glad to finally have a site to find 33/29"], "reviewed_date": ["May 14, 2018", "July 23, 2018", "July 1, 2018", "May 27, 2018", "June 2, 2018", "June 10, 2018", "November 12, 2018", "December 11, 2018", "April 13, 2019", "May 13, 2019", "August 27, 2019", "February 5, 2017", "January 9, 2019", "January 9, 2019", "February 23, 2019", "July 3, 2018", "July 5, 2017", "February 4, 2019", "December 14, 2018", "November 24, 2016"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Steve, ", "Super Don, ", "WAyne, ", "g, ", "Old Gringo, ", "Mary, ", "David N, ", "shakespeare, ", "Jamie, ", "Pat the Welder, ", "cameo, ", "Bill, ", "Robert, ", "Jamie, ", "TC, ", "Texas, ", "Jim in TX, ", "the hiker, ", "Debs, ", "Tom, "], "reviewer_rating": ["5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "4", "5", "5", "5"], "reviewer_headline": ["Second time purchaser", "Love them. Order online and get the right size always", "Well built, perfect fit", "I keep buying these jeans", "Better then Levi's", "Quality garments", "Great experience", "I'm sticking with LEE'S", "Greal Deal!", "I'll be buying it again", "I would buy these again. love them!", "Lee Jeans are the best!", "Heavy enough for dirty work.", "Great Deal!", "Nice jeans", "Lee Regular jeans", "buy this every time", "i would like a men's inseam of 28", "I have bought these jeans for my husband for the past 29 yea", "They look great, fit well."], "reviewer_comment": ["I wear these jeans every day at home, I could not be more happy with them.", "They wear great and last forever", "These rugged yet comfortable jeans give you a rugged jean with timeless style, the real jean!", "They wear longer then Levis", "Good weight fabric. Consistent fit.", "My husband's favorite jean. Bought for Birthday gift.", "Excellent service and price.", "Best fit I can find for my 34\" waist. Forget Levi's and Wrangler's.", "Work Wear, Play Wear, All time Wear", "I'm a welder so I need heavy fabric for work. Too many co. have too thin fabric. These are perfect", "I bought them my son and he loves them! Stay along time.", "I can always count on my Lee Jeans to fit perfectly!", "These hold up after washing in hot many, many times.", "Work wear, Play Wear, All time Wear", "Easy web and quick delivery", "My husband loves these jeans. Only jean's that fit him the best.", "the jeans are just what I want, been wearing them daily for several years", "length is too long need 28 inseam", "The only thing I don't like about them is they fade too early", "Thank you for continuing to make with a 29 inseam."], "reviewed_date": ["November 29, 2016", "January 24, 2019", "October 6, 2018", "July 5, 2018", "December 19, 2018", "December 2, 2018", "November 21, 2017", "June 1, 2018", "February 10, 2017", "July 17, 2018", "January 10, 2019", "March 1, 2019", "July 20, 2018", "February 10, 2017", "May 17, 2018", "April 14, 2019", "June 3, 2018", "September 30, 2018", "December 1, 2018", "October 1, 2018"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Jere, ", "Paul Zee, ", "Daniel, ", "None, ", "Kelly, ", "Lenny, ", "elgray, ", "Me. Wells, ", "Gary, ", "JD, ", "AJ, ", "HK, ", "Kris, ", "eovs, ", "Nathaniel, ", "Dan A, ", "Woodsman, ", "zlinme, ", "Tim, ", "Ken, "], "reviewer_rating": ["5", "5", "5", "4", "5", "5", "5", "5", "4", "5", "5", "5", "5", "5", "5", "5", "5", "5", "4", "4"], "reviewer_headline": ["Love my jeans", "Nearly 'Perfect' Jeans", "I will getting more..my size and fit are rarly in stores", "I will purchase this item again", "I will buy these again.", "Best Men's jeans", "yes, I am a return customer", "Lovelee", "Too Long", "Lee Jeams", "quick delivery, easy ordering", "I would buy this product again", "Lee Comfort Stretch Jeans", "love it", "My favorite Jeans brand", "This is one of the four purchased", "I would buy this product again.", "Great jeans", "Original Lee straight leg jeans", "Good stuff"], "reviewer_comment": ["My usual outfit- jeans and flannel shirt.", "Great Jeans . . from hangin out . . to work . . to Dress Up Events . . these are 'Go To Jeans'", "Fit is good..use these for work...", "Perfect casual jeans for everyday.", "Great all the way around! The fit was wonderful and my husband likes them.", "Always fit right, great material and last forever; only jeans I buy", "Very nice product, even thought it is foreign made.", "Great jeans at a great price. I've been a Lee fan for years.", "Length is much longer than my last pair.", "Great value & quick shipping", "Lee.com has all the colors and sizes.", "Daily jeans - just what I was looking for.", "My husband loved the comfort stretch jeans!", "I have been loving this jeans since 1994.", "Excellent fit, comforr and durability.", "Very reliable advertising its a true fit", "Everything went well from ordering to shipping.", "Been wearing Lee jeans for years. Perfect fit, perfect price, perfect quality.", "Good quality, great fit. Lee jeans an american classic.", "Waist runs SMALL, length true to size"], "reviewed_date": ["January 12, 2019", "September 9, 2018", "March 23, 2019", "December 26, 2018", "December 14, 2018", "November 2, 2018", "September 16, 2018", "July 28, 2018", "April 11, 2019", "November 14, 2018", "January 14, 2017", "December 29, 2018", "November 17, 2018", "November 25, 2018", "November 25, 2018", "October 29, 2016", "April 9, 2019", "November 15, 2018", "March 16, 2019", "January 21, 2019"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Don *, ", "scurvydog38, ", "Dick, ", "B, ", "Cody, ", "Nivek, ", "n/a, ", "Scurvydog38, ", "Joey D, ", "Me, ", "TIM, ", "Bob, ", "Bob, ", "Boblaf55, ", "Retired, ", "Boblaf55, ", "LJS, ", "steve, ", "None, ", "eda823, "], "reviewer_rating": ["5", "5", "5", "4", "5", "5", "3", "5", "5", "2", "5", "5", "5", "5", "5", "5", "4", "4", "5", "5"], "reviewer_headline": ["Terrific jeans, great color selection", "Good product very durable", "Yes", "I would buy this product again", "Have been wearing Lee jeans for the last 12 years.", "343", "I will buy again", "Quality product", "Jeans", "Returned both pair. Wanted size 42wx30L received 30wx30", "great jeans", "Yes I would by again", "Absolutely", "Great Jeans", "I will purchase this product again", "Great Fit", "Yes", "yes", "Yes", "Lee Jeans!"], "reviewer_comment": ["Nice fitting, comfortable and durable material.", "Good product", "None", "They fit comfortably", "Used for all occasions.", "343", "work and leisure", "Excellent product", "Very happy with jeans", "Wrong sizes", "I love my new jeans", "Casual wear", "Everyday wear.", "I love these jeans", "Everyday wear.", "Love these jeans", "Very good", "great jeans", "Wear every day", "I've been wearing Lee jeans for a long time. I hate going to department stores and digging through piles of jeans to look for my size which they usually don't have. I'm and average size guy 34\"/32\" and it's a hassle. I order on-line and 5 days later it's at my doorstop. Life is good and Lee jeans are the best!"], "reviewed_date": ["April 13, 2019", "December 10, 2016", "April 12, 2019", "October 9, 2018", "January 7, 2019", "December 8, 2018", "December 4, 2018", "December 10, 2016", "January 7, 2019", "April 13, 2019", "March 18, 2019", "November 15, 2016", "March 9, 2019", "February 9, 2019", "November 8, 2018", "February 9, 2019", "February 11, 2017", "January 17, 2019", "December 23, 2018", "June 5, 2013"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Nicola55, ", "HeathCliff, ", "mileo, ", "pjscreen12, ", "MWB66, ", "egallag444, ", "cptjeff, ", "kelsay33, ", "Highland, ", "terryb, ", "K.W., ", "Beachbound, ", "leejeanhappy, ", "beach, ", "Enoch, ", "cronie, ", "jpnycz2, ", "jlaw, ", "gillyschili, ", "FredRiedel, "], "reviewer_rating": ["5", "3", "5", "4", "3", "5", "5", "2", "5", "5", "5", "5", "5", "3", "2", "5", "5", "5", "5", "3"], "reviewer_headline": ["No Hassles", "Best Fitting Jeans No More", "Lee Reg Fit Jeans", "Good Value Jeans", "REGULAR FIT STRAIGHT LEG JEANS", "terrific jeans", "A lot to like.", "\"Regular\" fit Lee's", "Comfort and Looks", "I hope Lee continues to make these forever", "Great for work", "BEST jeans for women", "I have been wearing Lee J", "Good but listed sizes are VERY inconsistant", "Disappointed in craftmanship", "Hard to find", "Saving grace", "Great fitting jeans", "Mens Lee Jeans", "Great price but no fit"], "reviewer_comment": ["Bought 5 pair on line for the first time! Always had to search through the stores & try on everything because of the limited supplies in Lee jeans. Ended up buying other brand name in style or fit that was not my preferred choice. All 5 pair I bought on line fit perfectly and all styles and colors were available!!! I can't believe it took me so long to do this. All of my future jean purchases will be done here from now on.", "I must say that I was a regular purchaser of Lee Regular Fit Straight Leg Jeans for years, but the last time I bought a pair, I was astonished to find how baggy the fit was and had to return it. Haven't bought a pair since and won't...unless Lee decides to go back to the old fit. Why it was changed, I'll never know.", "Wow, what a surprise. A jean that actually fits in the waist based on the size stated. This is probably the first jean that I did not have to try on multiple pairs of the same size to find a correct fit. Excellent fit in seat and legs. The leg opening is also super - not oversize but just right. I would recommend deeper front pockets but that is minor..", "I have a lot of Lee Jeans and they are the only brand I am comfortable in. The fit is good, the service is great. The only drawback is that I have to have them shortened after I receive them. I would really like Lee to accommodate more lengths so I wouldn't have to alter the jeans every time I order them.", "BOTH PAIR OF JEANS WERE WRINKLED BEYOND BELIEF. THEY WERE IRONED BEFORE WEARING AND WERE STILL WRINKLED. I WORE BOTH PAIR TWICE. THEY WENT INTO THE WASH AND WERE IRONED AGAIN. THE WRINKLES WOULDN'T COME OUT. WHAT GIVES WITH THESE PANTS? THEY LOOK LIKE I'VE BEEN SLEEPING IN THEM FOR DAYS. TO BAD, BECAUSE OTHERWISE, THEY FIT GREAT.", "I ordrered these on line because its impossible to find the regular classic fit with a 28 inseam so on line i can get 29 thankfully.I wish you would make more colors in 36x29 classic fit. I would love to get them for my boyfriend in the light blue demium.Also a good color green and gray would be great.", "The fit is good, the denim is lasting and tough, and there's a good selection of colors. And the value can't be beat. The only drawbacks are that the denim doesn't fade that well, and that they are no longer made with the leather tag, which looked much nicer, allowed you to thread your belt through, and reflected a nice attention to detail that's been lost in the recent models.", "About six months ago, I ordered TWO pairs of \"Regular\" fit Lee's -- I have worn them for years, and always loved them. But these jeans were BIG and BAGGY -- hated them, and never wear them. Then, a couple of weeks ago, I ordered TWO MORE \"Regular\" fit Lee jeans -- SAME THING! Now I realize this is on me, particularly the second time, but either I'm through with LEE, or I might, I said MIGHT, try \"Slim\" cut, even though I'm not a particularly \"Slim\" guy -- but I am slim through the hips and have NO REAR END -- so this might be a workaround -- still doesn't mean I'm happy with LEE, because I'm not.", "I bought 3 pairs of regular fit straight leg jeans-- 1 blue, 1 brown and 1 black. They all fit well and looked great. My wife loves the fact that I bought the brown and black jeans instead of my usual choice of blue only. I am very happy with my purchase.", "As a middle-aged guy who has lived in jeans for 40 odd years, these are the best. I don't want jeans that are big enough for two people and jeans that hang down below my hips. I want jeans that show off the fact that I take the time to stay in shape. Lee Straight Legs are the ticket. If I thought they were going to be changed or discontinued, I'd spend what's left of my 401k and corner the market. Goodbye Gap, hello Lee.", "I'm an ecologist and I use these as my field pants. I've got three pairs now. I've tried Carhartt, Mountain Khakis, and other brands that make tough outerwear, but I've found that these Lees do just as well for me. They have the right amount of stretch to not hinder any of my movements, especially when hiking to my study sites. And the denim has held up to brush, dirt, mud, and multiple washes.The straight leg fits over my field boots and rolls up nicely for when I'm working in wet/mucky conditions. I also don't overheat in the summers because they breathe pretty well (much better than canvas!). That being said, they are a little thin for when it's really cold, so I may give the flannel-lined ones a shot.", "These are the best fitting jeans for women on the market today. I was MISERABLE with other brands and have searched for years for jeans that have this kind of fit, feel, and wear. I'm finally giving up and buying nothing but these jeans from now on. Yes I know they're for men, but female styles don't fit!", "I have been wearing Lee Jeans for over 10 years, I only order them from lee on line because I am consistantly shipped the specific size and no need to try them on. i get about a year and a half of wear out of them. The look good and hold their shape.", "I have worn these jeans for many years and if I happen to stumble on a size that works, they are great. However, the listed sizes don't mean anything. Clearly, the people manufacturing them don't know how to use a measuring tape. Over the years, I've discovered that the same size jean can vary by as much as 3 inches at the waist. This means that I have to return as many pair as I buy. Fortunately, if I am lucky enough to get a pair that fit, they will last me for quite some time. But finding the right size is a roll of the dice.", "On one of three pair I bought the back pockets are an inch (more?) higher than on the other pairs. They sit very, very, very close to the seam above. Feels odd and awkward using them, and the fit feels strange with anything in the back pockets.. On two of the three pair the back belt loops on one side were offset about an inch differently than the other side. Again feels odd and awkward using them, and makes the pants fit feel off. The value of a product really suffers when something about the product aggravates you.", "I had no idea that I could order my Lee jeans direct, until one day out of much frustration in trying to find black Lee jeans in the exact size I wanted, I happened on to the factory web site. As it turns out, with free shipping, I paid only two dollars more per pair than those through another mail order catalog....and in exactly the size and color I wanted....well worth it, and delivery was fast .", "When all else failed...LEE JEANS came through. I needed a few pairs of jeans in some color varieties. Well, after both mall and internet searches failed, only LEE came through with color choices. About the only thing I was looking for in addition to the color choices was RELAXED fit in addition to colored jeans. It seems nobody does this anymore. Even LEE did at some time in the past, but no more. Anyway, I went with REGULAR fit. Not my preference, but it somewhat works. Overall, the price was right...the colors were perfect and the shipping was quick. Again, I just wish (maybe as a Christmas wish) they came in REAXED fit to make things 100% perect!!!", "Lee Jeans are the best fitting jeans among all the brands. They offer many styles and my favorite are the regular fit , straight leg style. They wear like iron and are the most comfortable. I have tried all the others and Lee jeans are the winners by far.", "Could not find 35 waist Lee jeans in any store within a two hundred mile radius of my home and I went to a lot of stores. Visited Lee Jeans site which generated emails and got an email listing a sale so I ordered (4) pair. Thanks so much to Lee, I finally got exactly what I wanted. Thanks.", "The jeans were at a fantastic price but I should have gone to a store to try them on first. The regular fit straight leg jeans seem to be so much smaller for their size than the relaxed fit, which is usually what I get but the waist and inseam size was perfect for me so I thought they would fit not problem. Wrong. My mistake & I'll know better next time."], "reviewed_date": ["April 13, 2010", "October 20, 2013", "May 10, 2010", "January 30, 2010", "December 3, 2011", "January 1, 2014", "March 2, 2010", "December 17, 2013", "June 30, 2010", "April 14, 2009", "December 28, 2018", "February 18, 2015", "February 12, 2013", "August 12, 2016", "January 18, 2011", "February 28, 2010", "November 18, 2009", "December 28, 2009", "January 26, 2012", "November 18, 2009"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["ManitouCharlie, ", "5goldies, ", "WARAXE, ", "BFrank, ", "Rowlett, ", "CashmereGirl, ", "812michael, ", "ironsculpture, ", "Rick, ", "Vermonter, ", "Hou34ston, ", "Rocketman6, ", "RaySal, ", "beck, ", "rvd1, ", "DrSilverfox, ", "Bob, ", "WTS, ", "ellisrock, ", "Matthew Thomas, "], "reviewer_rating": ["4", "4", "4", "4", "5", "3", "4", "5", "2", "5", "1", "5", "5", "4", "5", "5", "5", "5", "2", "5"], "reviewer_headline": ["Lee Jeans", "Great Looking Jeans", "EXCELLENT FIT", "Regular fit jeans", "Consistent fit", "Styling has changed", "color", "Great color Well fitting perfect fit", "Short size needed", "Lee Traditional...", "Disappointed again...", "Almost Perfect", "Great Fitting Jeans!", "Jeans the fit", "levi/lee", "BE AWARE", "My kind of jeans for the last 25 years.", "So far so good & much better quality than competitor", "Why the changes?", "Quality You Can Rely On"], "reviewer_comment": ["Regular fit with straight leg. 38W x 32L I like these jeans and have been wearing them for many years. Unfortunately most places do not have all the colors, so I have to order them online. The only problem I had this time was that the dark brown pair is 38w x 32L but is actually probably about a 37w x 32L. They are much tighter than bronze pair I received. They are both 38x32, but sizes do not seem to be the same across the color spectrum.", "I purchased these jeans for my husband and he absolutely loves them. I got them in 2 different colors and both look great. The only thing is that they are a little shorter than his other jeans that are the marked as the same length. They still look good even if they are a little shorter. I haven't washed them yet so I am hoping they don't shrink otherwise they will be too short.", "Jeans received exactly as ordered. Fit perfect, just have to put in hot water. Negative is LEE tab sewn completely in! Change back to old style (Belt will fit through!) Excellent choice of colors but selections limited to website on-hand.... Feels and looks like MEN's jeans vice fad styles!", "I have been wearing regular fit straight leg jeans because they seem to fit me the best of any jeans. The fact that Lee has come out with new colors is a real bonus. Recently I bought jeans in the new colors of walnut and thunder and they look great!", "I predominately order my jeans online. What I appreciate is that the size (waist and length) never vary from one pair to the next. Thankfully it is not necessary for me to travel to a store to verify the fit. My one recommendation to Lee would be to move the front belt loops a little further away from the fly so that belts with larger buckles can be centered.", "My husband has been wearing these jeans for years and loves them because they're made for men over 40....classic fit with a slender straight leg. But when we ordered a new pair recently, we found that the styling had changed. They're wider in the legs now, especially through the thighs, giving them more of a relaxed fit look. (I measured them and the legs are one inch wider now.) They still fit in the waist and seat but the legs look baggy now and remind us of hip-hop style jeans. Ugh!!! He's returning them.", "The picture on the web site of jean color does't seem to match the jeans I receive. The color I think taht I have ordered has aways been darker than I would like. But I kept them because it is easier than returning. I like the product style and fit I just can't seem to get the color right.", "I have been wearing jeans all my life. The Lee jeans fit my body better than any other brand. The color selection is the best of any brand. They have a stylish tailored fit that compliments your body. They also conform and stretch to your shape very nicely. I am extremely pleased with my recent purchase.", "Your quality is good, your price is average to good, the look is good so why the bad review? Because you think all men have at least a 29 inch inseam. I'm sick and tired of all the attention being paid to big and tall while you expect shorter people to roll up their pant legs. I'm 5' 7\" but have a short inseam and I'm not alone. My guess is your best selling size is a 30 inch inseam because short people like me have to buy them but would prefer a 28 or even 27 inseam. It's amazing something so simple is such a big issue but it is. If you can't put them in the stores at least make them available on line.", "There are many brands of jean that I have purchased that have varying issues. Some rip at the edge of the back pockets, some rip out in the groin area, some even have zipper issues. With these Lee jeans, he experiences none of that. Would highly recommned these for work or casual wear...", "I decided to try this company again because my first two orders (LIGHT STONE) were exactly what I ordered. The last two orders were not the color I ordered. LIGHT STONE should not look like a regular BLUE jean. I will not be buying these online again.", "High quality jeans at a reasonable price. The regular fit straight leg style is trim looking without being skin tight...Just as I like them. But I wish they were avalilable in shorter inseams (I need to get them altered to 28\"), and how about offering a light blue version that doesn't look all beat up.", "I've bought and worn some top dollar brand name Jeans but they are either too baggy or the pant length is too long. Lee's Jeans have a variety of colors, styles,and pant length to choose from and the price is very reasonable. I wear these Jeans to work or for casual wear. The only pair of Jeans that actually have a great fit for me are Lee\"s.", "The value was great, however I was disappointed that the Jeans were not the fit i thought they would be, as the jeans flaired too much at the bottom. I usually buy Guys jeans because the women's do not fit well in the seat & thigh. Also you do not seem to have the size i usually want, ie 32\" x 29\"", "HAVE BEEN WEARING LEVI JEANS FOR OVER 50 YEARS AND LOVE THE PRODUCT BUT THEY CHANGED THE CUT TO BELOW THE WAIST FOR THE 505 REGULAR JEANS. TODAY I BOUGHT MY FIRST PAIR OF LEE JEANS REGULAR FIT PEPPER STONE JEANS...FIT GREAT ABOVE THE WAIST AND THE PRICE YOU COULD NOT BEAT...OUTSTANDING PRODUCT...GEE THEY ACTUALLY FIT..... THANKS..", "I love Lee Jeans. But you must be aware. There are two different fabrics in the Regular Fit Straight Leg Jeans. Even though all carry the same \"200\" + plus \"two digits for color\" ID, they are not all the same. One is \"mid-weight\" denim and the other is \"heavy-weight\" denim. Furthermore, there are two different waist sizes - all marked the exact same. I ordered 8 pair - having return 2 because waist 2 inches smaller. ALSO, it took 10 days from the order to delivery - UPS. This is way too long in today's online market. Even all said - still love Lee Jeans!", "I have been buying Lee Regular fit straight leg jeans for over 25 years and I'm going to continue buying them to replace the ones that I wear out. I like the 100% cotton material these jeans are made from and the way they just keep going wash after wash. They are comfortable to wear and last a long time and that is what I am looking for in a pair of jeans.", "A little concerned after reading all of these other reviews, but the two pairs I have tried on have fit just fine and they are not identical models. Hopefully the third pair will fit fine too. I bought them without trying them on, just purchased my normal size and they fit fine. I'm new to Lee, but had to find something else because the competitor I had been wearing hasn't had decent quality control for many years and I'm tired of it. I have some of their jeans that are 20 years old and they are still great, but everything since they moved manufacturing overseas has the same sewing/fabric issue with massive off center creasing that looks awful. Neither pair of Lee jeans had this issue so I really hope the quality and fit stays.", "My Lee Jeans from previous purchase were perfect. Decided to order more. Taking the number from the tag, I called Lee Jeans to verify ordering correct product. Ordered 3 pair. Same size, same \"model\" as before. New jeans arrived. Size, compared to old jeans, way too big, in all dimensions. Material/fabric had changed as well. Not as tight of a weave on new jeans. I suspect they will not hold up as well, and the fact that they don't fit correctly means I really can't wear them. Why the product changes? If they are changing the product, shouldn't it have a different number? So dissapointed...", "I recently ordered two pairs of pepper prewash jeans, and I am beyond satisfied with the purchase. They are comfortable, nice and thick, and they fit just right. Most importantly, though, they feel very sturdy and like they are made to last. I will continue to wear my Lee jeans with pride, and will most definitely be recommending to friends and family alike."], "reviewed_date": ["December 7, 2010", "February 6, 2012", "April 21, 2013", "November 24, 2010", "April 22, 2014", "January 1, 2013", "November 13, 2011", "August 9, 2011", "September 1, 2017", "March 3, 2013", "September 7, 2012", "February 22, 2011", "March 7, 2011", "April 14, 2009", "October 8, 2011", "October 31, 2012", "February 5, 2018", "October 17, 2016", "April 14, 2009", "November 13, 2016"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Jack, ", "MarkNYC, ", "Johnny, ", "Waywil, ", "g65to, ", "FARBOMAN, ", "Samstone, ", "fussyhusband, ", "Mephisto, ", "fivestars, ", "Markco, ", "paulas90gmc, ", "woodworker, ", "Zimmster, ", "blank, ", "Andy725, ", "eezy, ", "raider77, ", "Ron, ", "kamaki, "], "reviewer_rating": ["5", "5", "5", "5", "2", "5", "1", "5", "5", "5", "4", "5", "5", "5", "5", "4", "5", "1", "3", "4"], "reviewer_headline": ["Great Value", "The Genuine Mens Jean in 2019", "Good fit, comfortable.", "I have been looking for c", "I have been buying and we", "Finally I can get the colors I want", "Buyer b Ware", "better jeans!", "The brand I grew up wearing, I'm still wearing years later", "Amazed", "Great Pair of Jeans !", "Great deal", "Much Better Than Expected !", "Finally a Great Fit", "\"Change\" Pocket", "Fit for wear", "Great Jeans .. size a bit inconsistent", "Super Baggy", "Quartz color has poor material issues.rear pockets will tear", "Great jeans with design flaw"], "reviewer_comment": ["My size ie rarely found in most stores. It has been so easy to order and receive my purchase in less than a week, and they were just what I ordered, and just what I wanted. A good product at a great price. Why would I bother to unsuccessfuly hunt them down in a store, when shopping on line takes only a few minutes, and I immediately know availability. The only way to fly!", "Timeless cut, material and construction at excellent value. Comes in multiple light, medium and dark washes, with most 100% cotton - EXCELLENT if you want old school feel and drape! Best to confirm the material of your particular style choice on Lee's own site. If you want dressier dark jeans, I recommend the Ringer color for the deep indigo look, but know it will rub off on your light colored leathers (e.g. wallet, phone case, couch...) for a while if you don't wash it. Stout is also good, with 1% stretch which is minimal enough to feel like a jean and not some hipster legging. No...sizing isn't 100% consistent. But I haven't found a brand that's any better, so what matters here is: Lees are CHEAP, relatively speaking. Buy, try, and no need to cry if it doesn't work out - just donate and try a different style. Want more taper / shorter length? Take to your tailor. Again these are cheap. I appreciate that I can buy a jean that fits my waist and butt (the hardest part to get right) - anything below there is relatively easy to fix. Usually if it fits me up top, it's too tight in the legs. Fabric clinging to my legs and riding up when I sit down? No thanks.", "I have recently been experimenting with different jeans trying to find a good fit for me. I have found that these regular fit, straight leg jeans are just what I needed. Having owned \"premium\" selvedge jeans to Rustler's and Wrangler's I wonder why I hadn't tried these jeans before. I've worn from slim fit jeans to the current \"501\" with its updated fit. Technically all of the jeans fit me but I felt that they were lacking in one way or another, some fit well in the waist, but saggy in the seat, etc. These are not too relaxed, nor too slim fitting, these feel just right to me. I normally wear a tag size 33 waist in Levi's but size 32 in Lee fit me just right. One thing I have noticed, especially with the colored jeans is that they run a bit short. A tag size 32 length measures just barely 31 on my pair. Not a big deal - size up in length. The Tarmac and Gray colors are so nice, its nice to have some colors in my jean collection.", "I have been looking for colored jeans for sometime that were affordable. Saw a Lees jeans commercial on TV -went to their web site and now own 4 pairs of Lee jeans. Like the look, feel and fit. I wear them to work in the office and they look as good as they feel.", "I have been buying and wearing daily Lee jeans straight leg regular fit for over fifty years. I recently bought four pair and they are at least one inch bigger in the legs and even though they are marked the length I ordered, they are an inch longer than my existing jeans. They fit more like relaxed fit jeans and I am very dissatisfied.", "For some reason Lee jeans have always fit me best.....and for a long time I could not find retailers who would carry colors other than blue or black...finally...my fit...my colors...my brand...all at a very competitive price.... I am buying more as soon as I finish this review", "These were my fave go to jeans for years but after ordering several pairs recently, none of them fit!!! Hoe can this be?I contacted Lee and they said the cut of the jeans has been changed. They are sending me a return label....we'll see what happens next. I am really disappointed. I have going to stores and trying stuff on , its a real drag. I hoe they changed the cut back to what it had been for years before!!", "My husband has always been a die-hard, loyal customer of another well-known jeans company. I finally convinced him to try Lee because all his jeans are too baggy. Lee's fit better at a much lower cost. He liked them so much that he ordered 3 more pair! He would prefer slim fit, but we can't find any that come up to the waist & have a zipper.", "I remember growing up wearing my little Lee jeans, or overalls with my little Justin boots on and feeling great. Didn't realize I'd still be walking around in Justin boots and Lee jeans 30+ years later still feeling just as good. Thought I'd given up wearing trousers/slacks/jeans after serving in the military. Fast forward 11 years, and I went from having nothing but shorts, to now having 7 pairs on these jeans on hand. (Literally just walked through the door from Kohls from picking up two more pairs). Even during the Florida summers, I don't mind tending the horse farm I volunteer at in these jeans. They just fit great where they need to, without bunching up and being baggy.", "I recently purchased from your web site three pair (each different color). My local retailers don't carry much of a selection of Lee Jeans. Most of us know that when you walk into a store to buy jeans you pick up several of your size and go to the fitting room to see which one fits. Each one can vary by as much as 1\" or more in waist and length. For this reason I've never before ordered jeans online. HEY: all three Lee jeans were the same size, true to size, and fit perfectly. The cut of Lee jeans I already knew to be what I liked over others. I'm floored by this positive buying experience. Thanks!!!", "The Lee jean I purchased is Simple, Basic but is also a nice medium heavy denim material. It's what I would call \"The Middle of the Road Jean\" This pair of jeans you can go out to a party or wear to work around the house, since it is mid-heavy denim. Thank You, Lee", "I ordered these for my brother and am more than perplexed that all the men's jeans are 100% cotton and you don't have one pair for women. We don't all want stretch. I want some cotton jeans again. I wore Lee jeans for years (all cotton) and miss them terribly.", "I wore the other \"L\" jeans exclusively since a teenager but the price has gone up while the quality has gone down. After being disappointed for the last time a few years ago, I bought a couple pair of LEE jeans and now I am a total convert. The quality is excellent and the price is fair. I'm a carpenter so I go thru jeans quickly but the LEE's that I have been wearing have stood the test of time. It's also been quite a while since I have felt good about wearing jeans for other than work. Thank you LEE !!!", "I have been a customer of \"The Other\" jean manufacturer for more years than I care to remember. I don't know what they did, but nothing they have fits me anymore. I thought I'd give \"Lee\" a try, and am I glad I did. My first order was for 2 pair just to check the fit. I then ordered 3 more pair, these jeans fit just the way they should. Lee please don't change a thing, you'll have a customer for life.", "In an earlier time this 5th pocket was also called a watch pocket but I have always used this pocket for my coin change. In the Lee jeans I bought 3 or 4 years ago this pocket was both wider and shallower and was excellent for carrying coins. It is now too deep and too narrow for this purpose. Since this pocket is not in any of my other pants it's poor design more than out weighed by all of the things I like about my Lee jeans.", "I haven't worn a pair of Lee jeans since the early 80's. Our physical changes make it appear less of a fashion statement. I've gone through a change in my life where I lost thirty pounds. I thought I should try out a pair of Lee jeans. I got tired of the other brands and I was surprised to find out that Lee jeans still make a quality product. The regular fit was just right!!", "Great jeans and great color selections, but waist size a bit inconsistent. I bought a 32 waist before, it was a bit loose. So went to a local store and tried on a 31, fit perfect. Bought the 31 with the color I wanted online, but the waist was too tight.", "I have worn Lee jeans for 40 years. Now Lee has changed the cut on their regular fit jeans. Lee used to be the jeans that fit, now their the jeans that don't fit. This new cut is very loose and baggy. Levi did this same thing about 18 years ago. It would be nice to have a pair of the old Lee Riders", "I bought 6 pair of the quartz jeans style 2008934 in October. all have tears in the rear pockets already. called cust service and they were aware of the issue with this style. offered to replace all 6 pair, but suggested I change the color. they said the material was purchased from a 3rd party and is not up to Lee standards. Forms for warranty on their way, we'll see. But so far sounds like Lee is going to stand behind their product. It will take 3-6 weeks, so time will tell. Ill let you know what happens.", "I have been buying Lee jeans in regular fit and relaxed fit for 15 years. Lee Jeans fit my physique better than any other on the market. The only problems I have encountered are not being able to get all the colors in stores in my area, especially the light tan, which I wear for work a lot, and the light tan jeans have the same belt loop that tears out the same place on only the light tan jeans. I probably have 10 pair that I can't wear anymore because that loop tore out. Other than that I love them."], "reviewed_date": ["April 10, 2010", "April 13, 2019", "February 27, 2017", "October 3, 2012", "February 20, 2011", "April 24, 2010", "November 13, 2015", "January 2, 2010", "December 8, 2016", "November 18, 2009", "November 16, 2011", "July 22, 2014", "November 21, 2016", "October 23, 2011", "April 6, 2012", "November 14, 2011", "June 15, 2014", "May 3, 2013", "April 21, 2016", "October 13, 2009"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Ohsnowmom, ", "BogiesBud, ", "justmar10, ", "Happy Camper, ", "momof2, ", "Windsurf, ", "joha, ", "Milehikrs, ", "laserai, ", "Randy, ", "Sam75, ", "JohnB, ", "MattyO, ", "skiatch, ", "blarthomore, ", "Just Fred, ", "KAH15, ", "Studio54, ", "MacMaine, ", "RegularWheatJeansGuy12, "], "reviewer_rating": ["5", "4", "5", "5", "5", "5", "4", "3", "5", "5", "5", "1", "5", "2", "5", "3", "3", "4", "3", "4"], "reviewer_headline": ["Great everyday jean", "Long-Term Relationship", "Great value and style", "I am SO glad I found these jeans!", "Great Pair of jeans", "Change color names", "Length Problem", "Two inches too short", "Best Jeans for Me", "None like Lee!", "I was pleased to find men", "Tan Jeans", "Best Brown for your Bucks", "Belt Loops", "Lee beats Wrang", "Need to tailor.", "OK", "Best Fit..at any price", "Good Fit, Lousy Wear", "How Many Belt Loops?"], "reviewer_comment": ["Quoting my husband, \"The jeans are just right in the seat and leg. Usually I have a problem with the legs being to baggy. Quality and thickness of the material is just what I was looking for in a jean. It's not the thin designer jean material it's an everyday jean.\"", "I have been buying these jeans for years and don't wear any other kind. The reduced stars were caused by one pair I got recently that was labeled the same as my usual style and size but it turned out to be looser and about an inch longer than the rest. Don't know why. Overall, I'm very pleased by the product and Lee's service.", "We bought these online direct from Lee. 8 pairs total. 5 to replace outside work jeans in Aztec and 3 for casual evenings out in different colors like green/grey, tan and light tan. Great fit and perfect for work and play. My husband isn't one to wear dressy clothes and these are a step up from regular jeans.", "For two years I searched the stores for the style and size I wanted. Zero luck. It seems that when a man's waist size goes to 40, the stores think we're not worth it, or we hardly exist. So reluctantly I went online, very leery of buying jeans I couldn't try on first, and took a chance on these. Pay dirt! And there are so many colors to choose from. They fit great and the price is right.", "Great Price and great fit. My son is tall and lean. Very hard to find his size of jeans (31 x 34) in the department stores. No problem ordering directly for this web site. Got the jeans just a few days later, plus I also received free shipping on my order, every penny counts at Christmas time. I will definetly be back to place future orders. You have my business from now on...", "I love Lee Jeans. There fit is better than other brands and they last forever. My only complaint is for the non blue colors I have no clue what the colors are. What color is thunder? Make it easy on us for the non-blue shades just tell us what color they are online so we can order online and not have to ship them back.", "I have been buying Lee jeans for years because I like the fit of the Regular style. However, my recent purchases have revealed a problem with leg inseam length. The dark colored jeans have always come with the length specified. But the tan colored jeans were up to an inch short. Lee customer service was very good and refunded my payment when they said that they could not guarantee the specified length for the \"special\" dyes. So I will have to find a retail store where I can measure the length before buying the tan jeans.", "Jeans were great Lee quality material and fit, but pair shipped was at least 2 inches shorter than the size ordered. They were unusable -- thus the low rating. Had they been the length ordered (and shown on the tag), I would have given this item five stars.", "I have worn several different brands of jeans but in my experience these are the best jean brand for me. Anything else ends up not fitting the right way and ends up hanging on the rack never to be worn. So if your tall and thin, lee will fit ya just right. Plus the ladies will like ya for it, and ya don't have to raid ya piggy bank. Take it from me, I know these things. You want a good dependable pair of jeans that you will look good in, leave it to lee.", "I've worn Lee jeans exclusively ever since emigrating to this country in 1968. The fit has always been good, the material durable and the look just splendid. I'm always telling friends I'd make a commercial for Lee jeans gratis. \"Lee-the one for me.\"", "I was pleased to find men's colored Lee jeans available, once again. Lee jeans have always equaled Levi and other labels for quality but Lee is more reasonably priced. These jeans are beautiful and really enhance a wardrobe, providing the durability and comfort of denim in attractive fashion colors. A solid 5-star item!", "I returned this product. I was disappointed in the color. I purchased your tan jeans about four or five years ago and they were great. They were a lighter tan color and I was hoping that they were the same shade. The fabric was also more in a smooth weave, not as course as your regular jeans. The color is my primary concern though not the material. I only wear Lee Jeans and love your products. I hope in the your future product planning that Lee will offer the tan Jeans in the lighter shade.", "I originally came across these because I was looking for a good brown pair of jeans online. Not beige, not tan, not khaki, but brown. Turns out that not only was Lee Jeans the best game in town, they were the ONLY company offering true brown jeans in mens' sizes, (I was also looking for a good brown too, but shockingly Lee has stopped making jean jackets altogether). I'm happy to say that not only did they get the color right, but the fit, quality, value and material are all first-rate! A month ago I was a Levi's man. Now, all my new jeans from here on are Lee's.", "I have worn Lee classic fit straight leg jeans for years. They always fit great. I have noticed they are a little bigger in the hips and thighs then they used to be. I don't like that. But my biggest issue is that on size 33 waist and smaller they have reduced the number of belt loops from 7 to 5. That causes your belt to ride up above your jeans and looks and feels terrible... Please add the 2 belt loops back to the smaller size jeans. Thanks", "I've lost 40 pounds over the last year and when I put on my Wrangler jeans and compared them to my well worn Lee's it was abundantly clear which was the better product. The Lee's fit the way jeans I wear are supposed to fit; the other guys were just baggy. The specs were supposedly identical for both. Lee are the best all day long.", "About 3 purchases back the seat and thighs became very baggy. My wife has to cut the seam from knee to crotch to knee and take in 1.25\" at the crotch and resew. Wish I knew if there was a fit that would save us doing this. Otherwise better material quality than the paper thin Levis.", "Although I like the color and Lee has always been one of my favorite Jean brands, I am a little disappointed at the narrowness of the \"Regular fit\". It is more of a Slim fit compared to other brands who offer the same cut. I think it's a matter of preference so I will order their \"Relaxed Fit\" the next time.", "I went to countless stores trying on jeans at all price points!, I finally realized the best fitting pair was already in my closet! My 33-32 Regular Fit Lee's were comfortable and fit in all the right places. Went to the site to find cool colors that were not in the store (Quartz & Bronze washes) With the $ I saved I bought some boots!", "I've worn Lee jeans for a long time, mainly because of the good fit, but the last few purchases have been disappointing because of wear problems in the right rear \"wallet\" pocket. A hole wore through in 2 pair that I bought just 6 months ago. Don't know whether it is because of cheaper material or what, but it seems one should get better wear than that. Otherwise they are great jeans.", "I have been wearing these \"TAN\" jeans since Lee has been making them. I wear them until I totally wear them out and all the color is gone out of them. I have never wore anything more comfortable than these. I recently went online to order these because all the stores stopped carrying them. I ordered and received three pairs. I am dismayed to find that one of the belt loops on the back has torn out of the fabric. On another pair that same loop has started to go. I just went on line and see in your pictures that the loops in question no longer appear--there are fewer belt loops in your ad and the one on the back is shown on the seem. So, what is the story here? Has the design been changed? Is the weight of the fabric less and that is why they tear out? I will keep wearing them for there are no others. (We have repaired them.)"], "reviewed_date": ["November 19, 2009", "April 14, 2009", "December 26, 2017", "April 10, 2018", "December 28, 2009", "September 14, 2010", "February 2, 2013", "November 14, 2010", "December 18, 2009", "October 2, 2016", "January 19, 2011", "February 9, 2010", "July 1, 2009", "January 15, 2013", "December 29, 2009", "June 30, 2018", "December 11, 2015", "January 26, 2010", "May 15, 2014", "September 10, 2012"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["HenryG, ", "imhere, ", "rdc1253, ", "Smitty, ", "CompletelySatisfied, ", "agolfdog, ", "1catluver, ", "OliversMom, ", "sdlnsklf, ", "Dustoff, ", "sloco, ", "leeforever, ", "COACHDP, ", "Judge, ", "jht927, ", "slimjim, ", "raven04, ", "johng, ", "Eventhorizon, ", "Vince, "], "reviewer_rating": ["5", "4", "2", "2", "5", "2", "5", "2", "1", "4", "2", "1", "5", "5", "2", "5", "4", "4", "4", "4"], "reviewer_headline": ["I have 9 of the Straight Jean 20089443232 Pepper Stonewash", "It you need slim", "Bad Odor", "Changed the Pattern", "I purchased the regular f", "Ordered regular fit strai", "Great Fit", "Nice jeans, but not true to size", "What a waste of time!", "Good? but Different", "best fitting, worst wearing jeans ever", "Cut has changed! TOO BIG IN HIPS!", "Great Jeans", "Good Jeans", "Something's different!", "lee works for me", "I had been buying Levi 50", "Good buy", "Quality Control", "Consistancy"], "reviewer_comment": ["The fit and comfort are excellent and having 9 Straight Jean 20089443232 Pepper Stonewash and 3 of the Pepper Prewash (Dark Denim) (2008989) I have enough to keep in a good rotation for long term wear. The weight of the Denim is heavy, but comfortable. A huge benefit is the consistency of Fit. Many times jeans of the same style fit different pair to pair - not Lee's every pair fits the same.", "We read the reviews and thought that these would fit him better. The waist is great and the length but the legs are so much wider then what we thought. I guess you just don't make them the way you use too. We will have to look for slim for those men sho don't have much of a butt.", "I bought a pair of the Ringer regular fit jeans and they have this very strong smell. I didn't notice it until I was getting ready to wash them the first time. It's hard to describe but it reminds me of a black permanent marker. I have washed them several times but the smell is still there and it was picked up by the other jeans I washed them with.", "I was been buying the same size Lee jeans for years. My weight has not changed. These recent jeans don't fit the same as the former jeans did. They are looser at the seat and thighs, and they made the watch pocket smaller. They are not as comfortable as the old style. Bring back the old style.", "I purchased the regular fit straight leg Lee Jeans for 2 reasons. The first is that they offer a 31 inch inseam jean which is what I like, not 30 inch (too short) or 32 (too long) like other jean manufacturers. Second, they fit perfectly not being bulky, again like other manufacturers. In addition they are a great value. This comes after wearing another major jean manufacturer for years that i was not totally satisfied with, especially after they stopped selling a 31 inch inseam jean. Lee has my vote!", "Ordered regular fit straight leg jeans in a classic stonewash color. They came alot darker than I expected and what the picture showed. They actually look closer to the lead stonewash. I was very disappointed in them. I bought them for work and will wear them anyway rather than go through the hassel of returning them but will probably not order online again because of it.", "I always buy Lee for my husband. They fit him the best of any jeans. They are his favorite and come in a variety of colors. He works in a professional yet casual atmosphere and the colored jeans allow for him to look and feel polished. I just bought three pairs as part of his Christmas present! He'll love them.", "I really liked the color/wash of these jeans and was very disappointed that the size was not true. I ordered the size that my husband wears for jeans, dress slacks and suits. I guess he is just a standard size as all pants labeled his size fit (unlike ladies sizes...I can wear XL to a M depending on brand) - and I always thought that since men's sizes were based on measurements that they would be true. These jeans were waaaaaay too tight, not even close to being able to zip and button comfortably.", "This pair of Lee jeans is 3 inches smaller in the waist than the other 4 pair of the same size Lee jeans that I purchased in the past year. Now I have to make special trip to the post office to return them at my expense. What a waste of time and money!", "I recently purchased these jeans to replace a worn out pair that I've had for a prolonged time. I've been wearing Lee jeans for approximately 7-10 years, after moving from another \"L\" brand that no longer fit or \"felt\" the same. The first thing I noted was the fit; much looser than what I was used to. Secondly, the \"feel\" of the fabric was much softer than what I was used to in the past. Not bad, just different. I have to presume that Lee decided to change the fit and the fabric composition somewhat over time and I was unaware of this change. I've been wearing a jean made with a heavier(stiffer?) fabric and the \"softer touch\" threw me off. I have since learned that I've been wearing Style # 2008989 and just purchased Style# 2008940, thus the difference. I had to go to www.Lee.com to find this out. But in defense of Lee, their customer communication was excellent. Now that I know what \"style\" to buy, I will continue to purchase Lee products. It should be noted that after making Lee aware of my concerns,they volunteered to accept a return and even sent out a postage paid return label for the package. NICE GOING, Lee!! Not used but much appreciated!", "Bought a pair of Lee Straight quartz stone in the store. Best looking, best fitting, most comfortable jeans I ever owned. Went back to buy more, and they were out. Bought 6 pair on line. They started falling apart immediately. First 2-3 washings, they started ripping out at the top of the back pockets. Put patches in all of them at that spot, even the ones still intact. Now two of them are ripping along the back pockets.", "I have used these jeans forever. However, with the most recent order, I found that lee has changed the cut for this model number and now makes it much larger in the hips and thighs than it used to be. It looks baggy and empty in the large legs where it used to be close fit and fit my smaller frame. It is a shame that such a classic cut had to be changed. Lee's \"slim\" cut line is preworn and seems to be geared to younger men.", "I had four pair of Lee Jeans and just ordered two more. They are great, only problem is you guys did away with the \"sand\" color. Would like a light color to replace my sand color which are worn out. I bought a pair of \"dune\" which are fine, but would like a lighter color. Only complaint is your order pictures on line are too hard to tell the actual color. I now have two Rex's. But the jeans themselves are GREAT.....", "I haven't been a big jeans fan until I started a new job that allows me to wear jeans. Lee's jeans are right for me. I'm not into fad's, I just like the straight leg style but Lee's has style, quality, comfort, selection and are value priced. It has been a long time since I bought jeans and I had put on weight since my last purchase. Retail stores only had my style jeans in two colors. I was very pleased to find the website offered about 6 various colors in my size. Don't change a thing, I like it the way it is. Lee's are for me.", "My husband has worn this particular style of jeans for over 25 years. It's very obvious after our last purchase in Jan 2011 that there have been several changes in the style of the jean. The pockets are not the same, and they just don't fit as well as the identical jeans we purchased about 6 months ago. FYI... he has worn the same size for years, so that's not an issue. Change is not always good...", "have' nt tried lee for many years. thought they were kinda for cowboys. i'm glad i decided to give them a try. the regular fit straight leg is slimmer than other brands i've worn for years. thats a plus for me as i'm on the thin side. fits great and looks great. i bought 12 different colors and they all are great. very satisfied. price, selection and fit all first rate. fast service a plus too. did i mention my son thought they are pretty cool.", "I had been buying Levi 505 jeans since 1969. Since they are no longer made I tried several different jeans and decided on Lee regular and I'm glad I did. The look and feel are great and the price was fantastic. Thank you Lee, you made my changeover very easy", "I knew what waist and inseam I wanted, so I was able to get it without driving to different stores to find what was in stock. The jeans fit like I want, although all jeans in my waist size are a little baggy in the seat because of my flat rear. My only disappointment was the leather Lee patch is sewn shut. I've been threading my belt under the patch since 1954.", "I ordered and received two pairs. On one pair the outside seam on one leg is off, it starts at the hip and ends up at the middle of the foot. This makes the leg look twisted. Unfortunately I did not notice this until the second wash. Better quality control could prevent things like this. Other than that they are good Jeans.", "This product has been a favorite of mine for forty plus years. The quality, fit and durability has been unsurpassed by any other jean I've tried. I've come to rely on this Lee product to provide my complete satisfaction each time I purchase it. The on line procedure is easy and quick...I usually receive the products within 3-5 days."], "reviewed_date": ["April 25, 2019", "April 17, 2012", "February 5, 2017", "September 29, 2011", "February 28, 2012", "April 3, 2010", "September 8, 2010", "January 26, 2011", "November 12, 2012", "January 27, 2013", "October 23, 2015", "January 12, 2013", "November 28, 2012", "July 1, 2009", "January 26, 2011", "September 12, 2010", "February 13, 2012", "March 11, 2010", "October 13, 2009", "April 4, 2010"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Vette, ", "JeffR, ", "jsfrnk, ", "smmto00, ", "Slowalkintexan, ", "angelomendonca, ", "YKKAPI, ", "BOBBY, ", "weresmyoldjeans, ", "Praetorian1, ", "Doug, ", "drjbutler, ", "Golden, ", "dplacke, ", "Sgt524, ", "misterg, ", "Duece, ", "ccwerner55, ", "nfuwy, ", "jeanslover, "], "reviewer_rating": ["4", "3", "5", "5", "5", "5", "4", "5", "1", "5", "5", "2", "2", "2", "1", "3", "3", "5", "4", "4"], "reviewer_headline": ["Nice Fit", "Men's jeans", "Color", "New customer", "Regular fit jeans", "The best you can get in america", "A good fit and value..", "lee jeans", "dont fit", "Size/Color Differences", "Best Quality Jeans", "Very Baggy Below the Knees", "Lee Regular Fit", "Material is good. Color i", "Stright Leg Jeans - Sand", "sizes are not true", "One fits one's way to small", "Excellent value on size not found in stores", "Good value", "Good Advice"], "reviewer_comment": ["I'm on the trim side I would have given Lee Jeans a 5+ if they offered these jeans in a Trim Size. 1-2 inches smaller in the seat and thigh area.Their Trim Size is the same size as their regular fit jeans. However these are nice jeans overall. Have a great choice of colors and the quality is better than must.", "I have been a wait 30 for so many years. 30\" is not a matter of opinion, it is a measurement. I recieved 2 pairs size 30 and could hardly buckle them. They were more like a 29 at most. I paid to have them shipped back for 31. They arrived and they are still very snug. There is hardly a difference between the size. Surely not a ful inch. Yes they are affordable, stylish and comfortable, except for the waist. I'm now going to have to pay to send one pair back again. In YOUR size chart I will need a 32 if I am going to tuck in a winter shirt.", "I love Lee Jeans. The quality and fit couldn't be better. But.....I would like the color descriptions to be better. Colors are not always true on various computers (depending on your color adjustments.) And it is hard to determine for example if some names are shades of blue, gray, or dark brown. Delta, or quartz, are not colors exactly. So you are not sure if you are looking at a shade of dark blue or dark gray. Otherwise, The large selection of colors that stores do not carry is great. jsfrnk", "I was a Levi customer for more than 40 years. They changed the fit of the Regular Fit jeans. They shortened the waist and I could not stand the way that they sat low on my waist and encouraged \"plumbers butt\". I felt like I always wanted to pull the pants up although they wouldn't go any higher. Thank you for having a \"regular fit\" jeans. I am sure that more Levi customers will move to Lee once they find out you have the correct fit.", "have all the nice features. They are availabe in inseams shorter than 30\". In fact they are the only mfgr, that does. The belt loops are the right size and space just right. Pockets are the right size. The jeans have a nice soft feel yet hold up extremely well. Great value!!!!", "I tried a lot of jeans in america and I could not find a good cut. All of them had this baggy cut where I felt I could fit two people like me inside them. I remember my dad wearing lee jeans back in 1970's and I said I should try to find Lee in USA. The best jeans for a guy who is not small and who is not too big.", "Having tried other major brands with little success, I saw a Lee's ad and visited their web site.. Having never ordered jeans online, I decided to try a single pair to see if the looks and fit were what I wanted.. They were and I intend to order more. Not having a Robert Redford \"bod\", I am hard to please, but I think these will work fine..", "i have worn lee jeans for over forty years. i like the style's the fit and the comfort. i worked in the auto industry and never was fond of the coveralls i had excess to. in my early years i wore the stovepipe or boot leg cut. thanks for making it easy to order on line", "I have worn lee jeans for 25 years. I had not bought jeans for 3 years because I had plenty. Time to replenish my supply. After going to numerous stores and trying on numerous lee jeans I found that the thighs in all there regular fir jeans were a good couple inches larger. I even tried the slim fit only to find they were also bigger than the regular fit was. What happend please bring back the old cut. And I tried classic and same thing they are a lot more baggy. Iam vary disappointed.", "Great , easy ordering, great operator, quick delivery. Easier than going to a store. I have always been a Lee jeans guy, I'm tall and thin and I find Lee's fit the best. I do see the difference the color makes concerning fit. The light blue are baggier than the dark blue and the stone I purchased fit the best (slim), mostly around the thighs. Over all very satisfied with this shopping experience!", "I was required to wear light-colored pants while working as a manager at a big-box home improvement retailer, but I wanted something that would wear well because I'd be climbing and crawling throughout the store. I tried five pair of these jeans in tarmac and wore them for 3 years. These jeans are like steel and have lasted well beyond my tenure there. Since they're just now starting to look somewhat rough, I've ordered two more pair. They fit perfectly and seem to last forever. Highly recommended.", "So close to being satisfied, but NOT. These jeans look great and fit great north of the knees. But a key reason I bought this style specifically was for the 16\" leg opening. When I received them, they were 18\"! I frigging hate that! I get that some people like that and there are styles for them. But these specifically said 16\". That's not manufacturing variance; that's just wrong.", "I was excited to get a new pair of jeans through the mail instead of going out to a store and all that shopping involves. The first time I tried on my jeans the belt loop broke as I was pulling them on. Then I noticed that they did not fit the same as the previous 2 pairs that I purchased.", "Material is good. Color is good. Fit is good if you don't wash. If you wash, then you'll need to give them to Good Will. The waist shrinks about 2 inches. Really disappointed. I liked the material and color but they don't fit. Next time I'll order a larger size and maybe they'll shrink down to a nice fit!", "I'm been buying Lee Jean for over 50 years and have found that your jeans have had exceptional value. I prefer sand colored jeans but I can't find them in my local stores so I purchased three for the first time on line. I was satisfied with the price which would be what I paid in my local store but it was only offered in a leg length of 30 where my size was 29. It appears that these were of inferior quality for the first pair split after one washing, some thing that I've never experienced before.", "I have been buying Lee regular fit jeans for years and have been very satisfied,how ever the last several times I tried to buy some the length is about 2 inches to long I have always bought waist 30 and inseam 32 with no problem. I thought it was just the stock in one store but I tried three different stores and they all fit the same to long.please have the manufacturer check their tape measure thank you", "I purchased two pair of jeans both the same size, the heavy weight jeans fit great however the medium weight jeans aren't even close to fitting, way too small. Tryed on the pair that fit first and took the tages off both pair now I'm stuck with them.", "The Lee Regular Fit Straight Leg Jeans I purchased (two pair) were delivered quickly, fit well, and met all expectations. Purchasing was easy on-line, and the delivery schedule was on-time. This is an excellent value and so much easier than schlepping off to the store. The size I need (40x29) is usually never found in any store. I will definitely return to purchase here again.", "This style was the best fit for me. Now my waist became bigger, so I ordered the same style with \"current waist X old length\". Unfortunately the length doesn't fit me any more. So I had to exchange it. Anyways, Lee has very good customer service and this brand is highly recommended.", "I love Lee jeans. I have been buying them from retail stores all my life. This was the first pair I bought online. I did so because I wear a very common size and usually find that the stores are out of them unless I just happen to be there within a day or two of a new shipment. The only problem I had was the fit. I'm a 32-32, but what I received seemed to be more of a 32.5 - 33. They are a little loose and long, but not unacceptable. I tried to shrink them but they come pre-shrunk (I guess). I won't return them, but if I buy online again I will probably order a 31-31 or maybe a 32-31. Overall, they are a great pair of jeans."], "reviewed_date": ["June 21, 2015", "December 8, 2012", "July 6, 2010", "July 5, 2011", "November 18, 2009", "May 6, 2009", "April 30, 2011", "May 12, 2010", "February 14, 2015", "October 25, 2010", "September 14, 2017", "May 7, 2013", "January 29, 2013", "December 18, 2009", "April 14, 2009", "February 23, 2012", "November 7, 2010", "March 28, 2011", "September 17, 2010", "June 27, 2011"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["oldguy80, ", "Donnie, ", "lvfinn, ", "Whipzilla, ", "knaveoftrumps, ", "Biscuit, ", "Tiger, ", "snuffy, ", "cuzkuz, ", "TZ8V878, ", "PRO, ", "DanL, ", "SHiFTDi3S3L, ", "Rafi, ", "JOEL66, ", "largo, ", "DigLee, ", "Stoic, ", "Trish27, ", "jcan5369, "], "reviewer_rating": ["5", "5", "3", "5", "5", "4", "5", "5", "5", "5", "5", "3", "3", "5", "3", "2", "5", "1", "4", "4"], "reviewer_headline": ["Only jeans I wear.", "GREAT", "Regular straight legs vs. stone ground", "Regular Fit Straight Leg Jeans", "Smooth All The Way Around", "Great fit", "Best Jean Made.", "Jeans", "Fit like jeans used to fit", "Men's straight legs", "Perfect jeans!!!!", "Size Variations and Quality Control", "Bit loose", "Best jeans in the world", "Not what I like", "Not always what you see", "Color Warning", "Fits no more", "Good Jeans", "My Favorite Jeans"], "reviewer_comment": ["I've been wearing Lee jeans for over thirty years. Won't change anytime soon. Lee has the most comfortable fit available. The cut of the jeans, regular and comfort, is far superior to others. Lee has the most reasonable prices for their jeans I can find.", "This was a great way to buy jeans. I can never find the right size in the stores. You had a choice in my size. The fit was perfect. The jeans were delivered right on time and in perfect condition. I will continue to buy my jeans from you and will recommend your company to all of my friends. Thank you", "Found the Regular Fit Straight Leg pepper stone wash Jean to not fit as nicely (on my shape) as the classic stone wash jeans. Would've ordered classic (which I've been ordering for a long time), but they were out of stock so I thought I'd try the others. I sent them back. Don't get me wrong. These jeans are the same high quality as other Lee jeans, they just fit a little looser than I like.", "These jeans look great usually fit very good. I have 5-6 pair and I received 1 pair that fits a little looser and one that fits a little more snug but this is not a major problem. These jeans are very comfortable and fit much better than Levi's or Wrangler! Plus there are alot of colors to choose from ! Look no futher these are the best jeans on the market !", "Smooth all the way around. The website is easy to navigate, and the ordering process is simple. The order was processed immediately and the jeans arrived quickly. And my new Lee jeans fit perfectly. I cannot imagine a better overall online shopping experience.", "We were looking for a particular color and chose one too dark but they will do for now. Medium weight and would like it heavier but they are comfortable and stylish. They have the belt loops we need and not minus loops like some. Will drfinitely order again. Great price. Did not have to run all over town.", "I have been wearing Lee Jeans most of my life. I love their fit and finish. Also I am a conservative and want the style and features to remain the same as the last 35 plus years. Details such as the curve stitching on the back pockets, and the leather or man made LEE patch should not change. I did notice that the last two pair I purchased change was made. They came with the LEE patch sewn all the way around, I can't put my belt under the Leather.", "My husband was not blessed with a rear end. However these jeans make his back side very appealing. The legs fit great and the waist is the best fit . He says he will not wear any other jeans after wearing these. Even I love to look at him in these...and I m very hard to please. Thank God for LEE JEANS.", "I had worn Lee\"s years ago and had forgotten how good they fit. Bought one pair a while back online and then it hit me what I had been missing was just a good jean that really fit right and the price was good as well. Have placed 3 orders now. Buying online you have more of a choice than in the stores in my opinion. They're always out of my size or color but online you get exactly what you want. Takes less than a week to get em. I buy only the regular straight leg style and have not been disappointed.", "I'm 66 years old and I have been waring this style and brand of jeans for about 10 years and have been very satisfied with the way they fit, look and feel the fit is obsolutely great they never fall and give you a diaper butt look Like many other brands do, I may be 66 years old, but I still have some scroupols.", "I used to wear LEE Regular fit straight leg jeans for a last 10 years. Model 20089 is really perfect, not too loose, not too tight, very comfortable. Just received two new pairs in a \"new colors\". Jeans are really good - the same fit and quality, new comfortable stretch fabrics, stylish look with new attractive details like double-color stitching, new styles of labels and rivets and LEE label at the back pocket. Great thanks to LEE for reissuing classic fit jeans with modern stylish details.", "I have been buying Lee's Regular Fit Jeans for years, as I do find them more comfortable and a better value than Levi's. What has gotten frustrating, however, is the increasing (it seems) variations within the same cut and size. For example, usually my 32X29/30 fit pretty well around the thigh, but my most recent jeans I ordered seem significantly more baggy in the thighs. And some are narrower at the ankle (which I like), but most are wider. Some fit my waist fine, others are tight. In short, there seems to be little relative consistency in the same size. Perhaps the answer is to pay a little more and try the jeans on in stores rather than order on line. The selection in stores, however, is far more limited.", "The legs are a bit more loose than my old straight fits[2008920], loose enough to make them feel almost baggy. They're comfy though, I gotta admit that. The waist is perfect, compared to my old ones'. So if you could combine this waist with the leg fit of the 2008920's, it would be perfect.", "My son wears a 29\" waist and a 32\" inseam. You have no idea how hard it is to find jeans in that size. Plus, if you CAN find them, they cost a fortune and probably won't look that good on him. The Lee jeans not only come in his size, but they fit great, look good, and are very affordable. I think over the last year or so, I've purchased about six pairs for him. I absolutely love them!", "I really am not impressed with these jeans. I want my old classic style back but they were discontinued. I like the rugged working style jeans. I ride Harley's and horses. I don't want a Jean that's going to fail on me at the first sign of hard work. I want a Jean that's going to take a stone to the shin at 75mph and not tear a huge gash in the pants or my leg. These jeans are NOT it.", "I was very dissappointed with one particular item on my last purchase. The colors that are shown on the sample are not the colors that the items actually are. You have two lighter colors in the item I purchased. Sand and dune. I already purchased the sand color a few times in the past but was wishing they were lighter then they actually were on the sample. This time I looked at the dune color and it looked closer to a whiter color which is what I wanted. When they arrived, they were actually darker then the sand and that dissappointed me very much. Also, I wish they would come in a 28 length which they do not.", "I love the way Lee jeans fit me. I just wish there had been some words to try to describe the colors. Everyone knows how colors look different on different monitors and to only use one word to describe a color is not helpful. I didn't order \"Sand\" because it looked very light and slightly yellow, so I ordered \"Dune\" which looked almost identical on screen but just a tinge darker. Well it's MUCH darker than what my screen showed. \"Walnut\" I thought would be a rich dark brown but it's a little washed out-looking. And I really wonder what \"Bronze\" looks like! On screen it just looks like Black. Hey Lee, if you want me to help you write descriptions, just send me one of every color, in my size, and I'll write great descriptions for you.", "Been buying Lee regular fit for ages but this past year I couldn't find the right fit with the same style so I ordered them. Exact same style is now baggy and loose and I DON'T LIKE IT. Now I have to start all over with checking out other brands to find the tight fit I'm comfortable with. Thanks Lee!", "The problem with Lee jeans is that after washed for a few months, the hem starts unraveling and small white holes appear in the seams. Also Lee should make the length in odd sizes also like in the past such as 31\", 33\" etc. I have to buy a 34\" which is really too long, but yet a 32\" is too short.", "I work in the electrical trades and am not permitted to wear the traditional \"blue\" colored jeans. Any other color isn't a problem. I particularly like the gray and brown colors, as they hide dirt. It seems that these colors are not always available though. Two things I would like to see: colored jeans in relaxed fit sizes which is desired in the construction trades where you do lots of lifting and climbing ladders, ect., and heavier weight fabric, as the seams wear quickly."], "reviewed_date": ["March 9, 2012", "February 14, 2010", "February 7, 2011", "February 23, 2012", "August 21, 2010", "November 28, 2011", "February 23, 2010", "December 19, 2009", "July 4, 2010", "August 18, 2012", "August 22, 2017", "January 13, 2011", "January 24, 2012", "July 5, 2011", "March 11, 2016", "March 28, 2011", "October 1, 2010", "February 9, 2014", "August 12, 2009", "October 13, 2009"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Kyle in Maine, ", "kuzmen, ", "SlimTallDailyJeanWearer, ", "fotoguy335, ", "tonyNH, ", "Jonathan, ", "Di3S3L, ", "Steve, ", "LOGICO, ", "jim012243, ", "kpj72, ", "mjmcg714, ", "SadLeeCustomer, ", "hoppa514, ", "warbird buff, ", "doxiegirl, ", "Cary, ", "tom10i, ", "rob, ", "1Char, "], "reviewer_rating": ["4", "5", "5", "4", "3", "5", "5", "4", "4", "2", "5", "5", "1", "5", "5", "5", "3", "5", "1", "5"], "reviewer_headline": ["Finally found great fitting jeans for value price!", "Double-black ones are best", "Great Fit for the relatively thin & tall", "Good Value", "want the old lee's back", "Best fitting jeans......", "Been wearin them since I was 5", "Loyal Customer", "BELT KEEPS", "Color", "best fitting jeans", "EXCELLENT!!!!", "BEWARE! The style has changed!", "Finest jeans made", "Here, wear and everywhere......", "Great fitting jeans", "Good value", "Great Jeans Always", "i would not buy again until the old cut is back", "I order these jeans for m"], "reviewer_comment": ["I use these jeans as a daily non work pants. I am most happy in terms of its fit and then secondly the price. ****Fit: I have almost no butt and these jeans match that area (seat) well- - most other jeans are baggy everywhere!!I have literally been looking here and there for a few months. most stores here don't have this brand. Once I finally came across this brand and style- my long search was over ! Exciting! To be fair I've worn these three days but I don't expect them to change.", "For some reason I love this brand and style of jeans (and exactly double black color), and once I realized that haven't been buying any other type over last two years, I decided to buy a few of them online. It's nice that I (hope I) can rely on the fact that I'll be able to buy exactly the same type in the future. Retail shops often don't have certain types or certain sizes. They fit nicely, they look cool. The color and texture is somewhat unique. They are indistinguishable from black pants if you look from distance, so you can wear them with a shirt and a jacket, but you get all benefits of jeans too: you don't have to iron them! :) Definitely a good choice for someone who doesn't want to spend much time and money, but still want to look nice. Also, arrived quickly, delivery time above my expectations.", "These and Express thin, straight leg jeans are the only ones that fit me well. I've tried nearly ever brand in the last month. 6'1'' with around 31 waist in dress pants (32-33 for this Lee style - 32.5 would probably be perfect. I'm wearing these in 32 now and it's very snug). Probably about 1 to 1.5 sizes smaller in waist than standard fitted suit pant. The leg does not look too baggy at the knee down, but end up too tight around the crotch like most brands/styles. These were a bit slimmer than my old Lee \"relaxed\", which fit well because of the tapered leg. However, the \"relaxed\" became too baggy for me when they recently changed the styling over last year or two. These have a very nice look in the Quartz and Bronze stone wash.", "Good value, price, fit and style. Wish they did not wear out as quickly. Seem to be prone to tearing in the crotch after several months use. Wish the new \"Heavy weight fabric\" was really just that. Jeans are much thinner than they used to be, especially the \"Lead Stonewash - Heavyweight Jean\". Overall I still will keep buying.", "I've always, always worn Lee jean (40 plus years). I would buy serveral at a time and break in the new one's slowly as the older ones wore out or turned into RAGS. I've recently exhausted my supply and have been searching for the 'old' style fit and after return after return I finally called LEE corporate and asked if they changed something. They said they changed their regular fit to be more roomy in the seat and thigh . WHY ?? I'm now in a search for a jean with the old LEE fit. Why couldn't you have left good enought alone and came out with another fit, like regular fit with addded room !! or how about 'relaxed fit' I don't need to be lookin like a fool with my pants on the ground. Adio's LEE Jeans .", "I always loved Lee jeans because they fit me so well. I really liked my purchase and all but the only problem I have is that on one of my three pairs the length was one size longer than the other two. I wish they would have all come in the correct length.", "I've been wearin Lee's since I was 5 years old, quality hasn't changed. They're still the durable, do-anything, go-anywhere jeans I used to enjoy. They just look a lot better on me now because my mom isn't the one picking them for me. I love you mom, but you have no sense of style.", "I really like the way Lee jeans fit----for the most part. The quality control on the length is not consistent. I recently purchased three pair with 29\" inseam and none of the three measured 29\" and for that matter all three measured differently. The other disappointment I have is the denim weight appears to get less and less and therefore as work jeans wearout occurs a lot faster than they used to especially in the knees!", "I HAVE HAD SEVERAL PAIR OF JEANS AND THEY HAVE HAD THE SAME FLAW - THE BELT KEEPS TEAR OUT AT THE BOTTOM. ACTUALLY THE MATERIAL TO WHICH THE KEEPS ARE ATTACHED GIVES AWAY. I HAVE RIVETED THEM IN (NOT SOMETHING MOST PEOPLE WOULD WANT TO DO) BUT THAT SOLVES THE PROBLEM.", "Be cautious about the colors shown. I wanted to get the light cream color I had ordered in the past and ordered the Dune color thinking it was the right one. Not even close, much darker and brown than what I had hoped.. I also ordered the Battleship color thinking it would be grey but it is almost more of a grey/green than a true grey. I ordered the Light stone expecting it to be light blue and it was more of a regular darker denim tone. Live and learn.", "this continues to be the best source for a product i've worn for a lifetime. the color, fit and durability over the years has not changed and being able to have them delivered to my door is more than just an added plus.", "Again I have to say thanks to Lee Jeans for providing me with a great pair of pants!!. The cost is GREAT! the fit is fantastic!! best fitting brand of jeans I have ever tried.", "I should have paid attention to the recent style-changed reviews. The new styling really is significantly wider in the legs and looks baggy on me. I will be returning them.", "Lee jeans are, and have been, the finest jeans made. They fit especially well, are fashionable, if that's your criteria, and are most durable. Price wise, one cannot find a better deal. I have five pair to use with any occasion.", "Great jeans! I tried a few of the other popular brands and now I exclusively buy Lee jeans. The fit, the way they fade over the years and the wear are the deciding factors for me.", "I purchased these jeans for my husband who has a difficult time finding jeans that are a great fit..These are perfect, great price, good quality and quick delivery time. Thanks, Lee Jeans!!", "These jeans are alright. I have the same cut in other colours. My only complaint is that the colours of these (Walnut and Fatigue) are much darker than I expected based on the website images.", "Love these jeans. They fit me better than most other brands and they come in my size, which many others do not. Please keep offering jeans in 29\" length.", "their not straight leg the fabric is not 14.75oz and the rise is to hi the zipper is shorter lee used to be the brand that fits now its the brand that does not", "I order these jeans for my husband whenever he's ready for a new pair. Always satisfied.... So much easier than going \"shopping\" too and you can't beat the price and no shipping charges."], "reviewed_date": ["November 3, 2016", "February 21, 2010", "December 12, 2012", "January 28, 2010", "February 29, 2012", "February 7, 2010", "November 19, 2009", "May 5, 2018", "April 15, 2009", "December 10, 2013", "November 21, 2010", "May 12, 2010", "January 16, 2013", "January 13, 2011", "January 26, 2018", "March 31, 2010", "September 12, 2011", "November 20, 2011", "March 6, 2018", "March 5, 2011"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["rewilliams2, ", "notasdescribed, ", "kathryn, ", "Tdog, ", "Andrews, ", "nanamama05, ", "Harrytwotwo, ", "10rated, ", "Saxoner, ", "George65, ", "Barbmj, ", "Catlady, ", "cottagelife, ", "chicothemule, ", "artiger, ", "eronney, ", "mollysdad, ", "Lindsey, ", "03Ryder, ", "LESM, "], "reviewer_rating": ["5", "1", "4", "5", "5", "5", "1", "5", "5", "5", "5", "4", "5", "5", "3", "5", "5", "5", "4", "5"], "reviewer_headline": ["better than Levi", "Not Straight Leg", "Hard to find size", "Perfect fit", "Great Jeans", "Great fitting jeans", "Don't buy this product if", "Best jeans on earth", "Great Jeans", "last almost forever", "Really great fit", "Finally a pair that fits well", "Best fitting jeans", "best ever jeans", "These jeans fit good. The", "They are the best fitting jeans!", "Lee Jeans", "A lifetime with LEE Jeans", "Black Quartz", "Exactly what my husband w"], "reviewer_comment": ["These have 3 belt keepers in the back, where Levi only has one. And the waist is slightly higher so it rides better on my waist. Add to this the much lower price than Levi's, and this is the best built jean at a lower cost. Can't beat that!", "These jeans are called 'Regular Fit Straight Leg Jean.' From this title, a rational person would assume that the leg is straight. In fact, the leg is tapered (not just a little, but a significant taper). I will not buy Lee jeans again.", "Lee is the only brand that comes in a 35 waist. The fit is flattering, not the \"baggy look\" My husband likes them so much, that at this price, we ordered 5 pairs!", "I have spent my whole life looking for the perfect fitting jean and finally found it with the Lee Regular Fit Straight Leg Jean. I have been buying online now for 3 years and have never been disapointed.", "Nice fitting jeans. Quality fabric and very comfortable. Price and free shipping made them very affordable. I will be adding more to my supply of everyday clothes.", "My husband is hard to fit in jeans. Most are too baggy in the seat. These jeans are perfect. We just placed an order for the exact jean in Double Black.", "Don't buy this product if you are looking for consistency. The cut is not the same lenght or width, the fabric appears to be lighter in weight, different lenght zippers and a belt loop is missing. This was my last LEE purchase. BEWARE!", "All of the items I purchased fit perfectly. I bought them on-line because of the wide selection & many different colors,which are not available locally. Keep up the good work.", "I finally found somewhere I can get jeans that fit me, I have a narrow waist and short legs and these jeans where perfect. Love the color choices also. I highly recommend Lee to anyone looking for choice and style, 5 stars.", "I still have LEE jeans from 25 years ago. Gained a few pounds this year. My 31's and 32's were just a bit snug. I increased 1 size up - perfect fit. With LEE you can trust that the size is true, if they fit you before they will surely fit you now.", "These were ordered because a 35\" inch waist is not available in any store in the area. My son has worn Lee Jeans and has been a 34-34 for years. Needed a 35, and loves the fit. As he says \"Perfect\".", "My husband has a hard time finding paints that are size 35 and also not real baggy in the legs and back side. He has skinny legs. these look n fit great. They are made very well n lots of colors to pick from.", "It's true; Lee Jeans fit my body better than other jeans, especially around the hips. It is awesome that you offer a 35\" waist in two colors. My wish is that you'd offer a 35 in Tarmac!", "I've worn Lee regular fit jeans for over 60 years, yes I'm 67 years old and wear nothing but LEE! I do miss Classic Stone, but really like the new colors, especially leather brown and fatigue.", "These jeans fit good. They are not as good as the old style lee made. The old style were a thicker fabric & the desing of the rear pockets was better. These are cheap looking & cheaper made jeans compared to the old style.", "I like how these jeans fit. They come in many different colors and shades, so you can wear the jeans almost everyday and change the color. They are my favorite jeans.", "I like them because they fit well, there are no pleats to make you fell like you are wearing pants from Omar the Tent maker, they lauder up nicely as well", "I have worn LEE Jeans all of my life. I have worn other jeans on occasion but no jeans have ever fit me as well as LEE's. They are the most comfortable jean I have worn. I feel at home in my LEE Jeans.", "Great style and fit. I assumed Black Quartz would be an off shade of black. Nope, nice dark shade but looks more like blue indigo . Still like them though!", "Exactly what my husband wanted - wear well, size available, shipping timely - the only way for him to get his Lee jeans easily! Only jeans he'll wear now."], "reviewed_date": ["January 19, 2011", "November 18, 2009", "January 28, 2010", "November 9, 2011", "November 4, 2013", "October 30, 2012", "January 15, 2012", "September 11, 2012", "March 15, 2010", "December 15, 2010", "January 30, 2010", "March 25, 2018", "November 9, 2010", "October 1, 2011", "August 31, 2012", "January 18, 2011", "November 18, 2009", "April 14, 2009", "April 13, 2014", "May 30, 2010"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["NonStretch, ", "Desert, ", "mwatkins3, ", "Troy, ", "rod0625, ", "cybil, ", "stever516, ", "netrich, ", "Photoguy, ", "Valerie33, ", "LoveLees2, ", "zbad156, ", "MrDe, ", "snicklefritz, ", "rkfeb, ", "cdmco, ", "SgtRock, ", "mell, ", "Sadie, ", "Tboy, "], "reviewer_rating": ["4", "1", "5", "5", "4", "5", "5", "3", "5", "5", "5", "5", "4", "3", "5", "5", "5", "5", "5", "5"], "reviewer_headline": ["All Cotton Jeans", "Wrong sizes", "Best of the best, better than the rest", "Great Jeans", "Lee jeans are best", "they fit--he LIKES them!", "Great Experience.", "Jeans fit great but...", "My go to jeans for everday!!!", "Awesome Jeans", "Love Love Love these Jeans!!", "Back Again", "OK jean", "color options", "great jeans", "smaller waist than others in same size", "Comfortable as always!", "Nice to wear", "Best Fit", "Great jeans."], "reviewer_comment": ["I bought these because the are 100% cotton - no spandex, elastene, stretch cotton - just cotton which I cannot find in women's styles and I have tried. When I find something that works I go with it and these work - yes they are men's jeans!", "Bought 2 pair of the exact same size of jeans that I am wearing now and have worn for a decade. What I was sent did not fit. Too small, not happy and will send these 2 pair back and buy from a local merchant. Don't buy these online.", "I have found \"Lee Jeans\" to be the best of all the other competing brands. Not only are they the \"Best of the best, better than the rest., they outlast all the rest.", "I switched to Lee jeans about 2 years ago, and just found the web site, and after ordering 2 pair I have ordered 10 more, the jeans on the site seem to be a little smaller than the ones I have bought in stores, but that worked out better for me.", "I buy only Lee jeans because they fit me the best and are a great value for the money. It is handy to order from the internet and I have had no problems.", "Lee's brand fits him the best--lets face it, he isn't going to try on ten different pairs to figure that out. That's why men get married--so they don't have to shop for clothes and they'll always have underwear!", "The choice was there. All Colors, and sized true to form. Shipping was fast and confirmation of order well done. U Bet I will be back. Great Experience.. Keep it up.", "These jeans fit great but quality is lacking.Cuff bottoms frayed on each leg.If that is ok with you,then these jeans are great.Personally I prefer better quality for the price of these jeans!", "These jeans are so comfortable and fit nicely with someone of a smaller waist(28 inches) like myself. It's very hard for me to find clothes that fit like these jeans do and I am happy that lee offers them in such a variety of colours.", "I bought these jeans for my sweetheart who is very tall and thin. (30/32). and it is very difficult to find the right jeans. These fit PERFECTLY and look TERRIFIC. We both LOVE them. Thank you !", "My daughter bought Lees for me years ago and I am still loving them. I can't imagine ever wearing any other brand. Please, do not stop making these jeans.", "I used to wear Lee Jeans all the time,for some reason I got away from them.But wearing the pair I just bought I am remined of how comfortable they are and how tough they wear. I love these jeans and will never switch again.", "Good jeans--ok fit--shorter inseam-28\" and short rise-for shorter cowboys would be good. Colors are poorly represented on line. Can't seem to get the good plain deep indigo blue of the 50's, but I still prefer Lee.", "I don't think you portray the colors of the jeans on your site. I ordered what I thought was a light blue stonewashed jean and got a regular colored jean. The web page showed these jeans being light blue.", "great jeans, fast delivery... only problem found was leg length.. each pair the length inseam was different .. had to have length re-cut .. but over all very satisfied ..", "the particular pair I got (by mail) was much smaller in the waist than others that came that day marked in the same size and cut. (returned them). They looked nice, though.", "Jeans were sent in a timely manner. A lil long for tennis shoes, but I have a short inseam. Will look good with boots. Next time will order 28\" vs 29\". Very pleased. You can NEVER find the shorter inseams in stores.", "I bought a couple of pairs and the quality and value was consistant in both pairs. The colors available were just right. The fit was really quite good and the shipping was really fast.", "My son has always like Lee Jeans he said they are the best fit for him. I always get them for him for specail ocasions such as Christmas, and birthday.", "Extremely prompt delivery. Colors that are not available at most retail stores. I'm a tall, slender man and size 30, 34 available in most colors. Very pleased."], "reviewed_date": ["January 24, 2015", "January 18, 2016", "August 13, 2010", "December 13, 2010", "December 19, 2009", "December 28, 2009", "March 6, 2010", "March 23, 2010", "January 19, 2015", "March 22, 2014", "January 8, 2013", "October 9, 2012", "May 15, 2011", "November 26, 2011", "January 25, 2011", "January 13, 2011", "February 8, 2010", "December 28, 2009", "January 18, 2010", "April 1, 2010"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["maver1xmom, ", "weavus135, ", "DeadwooDemon, ", "engineer, ", "ahmedzangana, ", "ezhillfarm, ", "cobra, ", "jrmjr, ", "bigdog123617, ", "Donny, ", "xena4657, ", "NiagaraTom, ", "Gman, ", "deadeye, ", "ncfitzpatrick, ", "Coolcat, ", "villager, ", "QltnBird, ", "Heylady122, ", "cricketmom, "], "reviewer_rating": ["5", "3", "4", "5", "5", "5", "5", "3", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "4", "5"], "reviewer_headline": ["The best jeans!", "Thunder - it is not the gray I remember", "nice fit", "Lee's vs Levis", "Great Jeans", "Best pair of Jeans!", "Reg fit straight leg jeans", "stopped making my size", "I've been buying these je", "Regular Fit - YAY!", "very comfortable", "Best jeans around", "Excellent Buy", "last order", "Lee Jeans-inexpensive but best value for the money", "Great fitting jeans", "Love the different colors", "Favorite jeans", "Lee Regular fit", "Best of the best!"], "reviewer_comment": ["My husband wears the black jeans to work in a business casual atmosphere. They hold up all day looking as fresh as when he first put them on. Comfortable and stylish, definately recommend them.", "I love this style jean. I wear them every day and that is literally the truth. I have 6 different colors and I wanted gray. Midnight is not gray. They have a blue tinge and I wish they would bring back the old gray. I'd buy them in a NY minute", "I purchased these jeans for my husband as I like the fit of my Lee jeans. The men's jean also looks good on him but he is concerned that the light zipper may not last as long as the heavier zippers he is used to.", "As far as I'm concerned-there is no comparison. Lee jean are a far better value , both in cost and fit /styling. Case in point: Lees have 7 belt loops vs Levis 5. As all you plumbers out there know this is a good thing.", "I ordered 32X32 Dark stonewash (Regular fit straight )online & had them delivered to me here in Kurdistan, Iraq. The size was perfect & the quality is great, really heavyweight denim. I will definitely order again.", "I love these jeans! They are hard to find in some stores, so I always order them on line. They fit at the waist and are so comfortable! I won't wear any other jeans.", "I've been purchasing Lee for many years. Great quality, durable, and great fit.. Comparing Levis regular fit to Lee, Levis are definitely baggy! And I'm not getting paid for this statement.", "I loved these jeans. They fit well, looked good, and held up well. But they quit making 31 lengths. That means that 30s are too short and 32s are too long. I'm looking for another brand now.", "I've been buying these jeans for year's, however lately I've not been able to find them in stores in my size,so you go right to the source, my favorite jeans. wouldn't waste my time with other brands, a great product!!!!! Jim", "I've been wearing Lee Jeans for years, and always know what I'm getting. I am glad that the company still believes that \"if it ain't broke, don't fix it\".", "I bought these jeans for someone who physically works very hard. They are comfortable, fit great, and stand up to physical labor. These are the only jeans that seem to last.", "I absolutely love my Lee Jeans. They are the most conformable and best fitting of any I have tried. I've tried other brands and just don't wear them. I live in Lee jeans...", "I used to wear nothing but Levi's. I bought a pair of Lee's and have never went back to Levis. They fit better and are lower priced., you cant find a better bargin in any other Jeans. I highly recommend Lee jeans.", "My wife saw your free shipping offer and ordered two pair of jeans for me. Been lossing weight over the past few months,so now I have two brand new pair of jeans that are too big!", "The only negative I would say is the choice of colors in my size. These jeans are the best I have worn in many years and I will continue to buy Lee for the value they offer", "This is my first experience with Lee jeans for men and I couldn't be happier. They fit and look great and are half the price of the jeans I was getting from other retailers.", "I love the different colors. I wish you would make the men's shorts in different colors also. We need a little variety in our lives. Plus the jeans fit very well and you have a 29 inch inseam which is hard to get in the stores.", "Lee men's classic are my favorite jeans. Great fit! I can always count on your quality. Slim or regular fits are harder to find and loose fits are not my thing. Thanks for keeping the classics.", "I ordered the Men's regular fit in brown and a grayish color for my husband. They fit him extremely well. He isn't suffering from the normal droopy butt pants.", "Lee jeans always fit the same. Order anytime and always experience the great same stellar fit as the first order. Durability is excellent, awesome color choices, unbelievable size options, shipping is cheap!"], "reviewed_date": ["August 23, 2010", "September 28, 2010", "December 28, 2009", "November 28, 2012", "August 17, 2013", "April 14, 2009", "April 27, 2011", "June 3, 2013", "June 11, 2012", "March 13, 2012", "April 3, 2010", "May 2, 2011", "December 18, 2009", "April 12, 2011", "April 15, 2009", "April 2, 2013", "March 10, 2010", "September 28, 2009", "December 28, 2009", "April 30, 2010"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Oblate53, ", "Al, ", "dave51, ", "Coose, ", "CaliforniaHerbie, ", "smile, ", "vobidalatvn, ", "Tony, ", "nhoj, ", "Keith43, ", "Daytrader9, ", "cher, ", "Rick, ", "bigmama555, ", "SteveB, ", "SpokaneRod, ", "VShaped, ", "chaslt1, ", "fanolee, ", "oldcowboy, "], "reviewer_rating": ["5", "1", "5", "5", "3", "5", "3", "2", "5", "5", "2", "5", "5", "5", "4", "5", "5", "5", "2", "5"], "reviewer_headline": ["Love my Lee's", "Poor fit", "Lee jeans have always bee", "Best all around jeans", "Run smaller than Levi and Wrangler", "Great extened sizes", "I am disappoint at this p", "Got cheap with the zipper length", "Great Jeans", "Everything I expected", "Way too small", "BEST FITTING JEANS", "Great quality and fit", "jeans", "Jeans sizes", "Men's Regular Fit", "Nice Pants", "Almost Perfect jeans", "Disappointed", "Best fitting jeans"], "reviewer_comment": ["I live in a rather small city (pop. 49,000) and nowhere can I find Lee's without driving over 30 miles. I love the pants so much because of the fit and look, I buy them online. \"I Love You Guys\".", "Just bought the pepper prewash and the fit was horrible. I ordered size 33 29 and it fit like a 35 29. Another problem i have is that the jeans sit low on the hip wich makes me have to hike them up.", "Lee jeans have always been a good value,they fit comfortably and look great,my only regret with LEE is that they stopped making odd lengths several years ago,other than that ,I love em.", "Can't say one negative. I've been wearing these jeans for years. Great color choices, great price, great fit. Always fit the same. No surprises. Couldn't be more convenient for someone who hates shopping like myself. Thanks Lee!", "Title says it all. My husband would need at least one size larger in this jean than the other two brands. Other than that, they seem fine but since they don't fit, we really can't rate the jean.", "Love that I can get a 30x34 and 31x34 for my son...stores don't carry them. Also, we tried another brand and they frayed at the zipper and pocket...his Lee jeans have held up with NO problems.", "I am disappoint at this purchase because of size these pair of jeans is totally different from the pair of jean I bought in the past even they are exact same size.", "Bought these jeans right from the website. I've always worn Lee Jeans and fit on these jeans are fine.The problem is they got cheap with the zipper length.Its 1 inch shorter then my older jeans.", "I've worn Lee jeans for most of my adult life {76yrs}. and believe they are the best available. Great fit and wear well. I hope to be wearing Lee jeans for many more years.", "Jeans were everything I expected them to be.fit perfect and could tell they were well made. My shopping experience was easy and my order was shipped promptly.", "I just bought some Lee's slacks that fit and looked great for a good price. I ordered some jeans in the same size. They were 6 inches too small. The waist was 3 inches below where my slacks waist was.", "I AM SO HAPPY THAT I FOUND THESE JEANS AGAIN...HAVE A PAIR THAT I HAVE HAD FOREVER AND COULD NOT FIND THEM EXCEPT ONLINE. I AM THRILLED BECAUSE THESE FIT TRUE TO SIZE AND LAST FOREVER!", "I've been wearing the same style for 30 years (20089). The fit is always consistent and the quality and comfort is 5 stars. You can't beat all you get for such a terrific price.", "lee's are the only jeans my husband will ware they always fit him well in all the right places never baggy or to long or short and of very good quality.", "I like the selection of colors and styles, but it is often difficult to find my size in many of them. Either the waist or the length is frequently X'ed out in my size.", "I love Lee jeans. I've tried several other, but always come back to Lee. Great fit; great color selection; good prices. I have but one request: please offer a tapered leg in regular fit. No jeans - at any price - are better!", "The waist is true to size, and they're made from nice thick fabric. The seat and thigh area are big. I've tried many name brands and these fit the best. I guess that's what happens when you're shaped like an ice cream cone.", "What a pleasure to order these jeans, get them delivered, try them on and SMILE. No alterations req'd and that is a first for me. Great fit, quality and material. Excellent price too. Wish they came in a 28 length, but that is not a complaint.", "I hand-washed my new jeans in warm water and, after several rinses in cold water, the blue dye was still coming out. Stupidly, I put them in the dryer and now the inside of the dryer is blue. It's a mess.", "I have tried three other brands of jeans was really disappointed. They are not made like they used to be??? The Lee jeans fit as noted. Hope they get the 33 29 size again."], "reviewed_date": ["March 30, 2011", "September 25, 2016", "December 10, 2011", "November 16, 2012", "October 9, 2012", "May 2, 2012", "January 14, 2011", "April 22, 2017", "April 21, 2012", "October 15, 2013", "December 27, 2011", "January 25, 2011", "February 15, 2018", "December 12, 2012", "January 18, 2011", "July 15, 2013", "August 25, 2010", "November 13, 2009", "September 10, 2015", "March 13, 2013"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["tomgaroo, ", "crocket49, ", "NJFan, ", "2bjj, ", "Acedog, ", "jdmurra, ", "rustymo2, ", "Leebrandfan, ", "bigbander, ", "poptones, ", "ShawnCho, ", "calmiester, ", "Ylynn, ", "jerryg, ", "Lakehousegirl, ", "matt, ", "Candyman, ", "Memphis, ", "NoLee, ", "Mrclean, "], "reviewer_rating": ["4", "5", "5", "5", "1", "5", "4", "5", "5", "5", "2", "5", "2", "5", "5", "1", "4", "5", "1", "5"], "reviewer_headline": ["A Lee Guy", "Great fitting jeans", "Best fitting jeans!!!!!!!", "Best fitting jeans", "Broke first day", "Just what I wanted!", "I placed two orders from", "Best Jeans", "Feel good fit", "great jeans", "not regular size!", "I really enjoy to 2 pair", "Inconsistent sizing", "Great jeans", "My husband loves these jeans.", "these are not the \"old\" regular cut jeans", "Online order", "Love them", "One of the two Jeans ordered was defective", "Best fitting jean"], "reviewer_comment": ["Every Lee jean that I purchase is done so with the expectation that it will fit and look better than any comparable product. Throw in the great price of the jeans and you simply can't go wrong. HIghly recommended.", "My husband loves the fit of his Lee jeans and the value. He has tried all different brands and always says, why did I do that,I love my Lee jeans and he will always buy Lee jeans. Thanks for great fitting and looking jeans.", "It is so convenient buying right from the source! Most stores don't always have the color or size needed. Here you get exactly what you need with super speedy shipping. Also, the price is right!! :)", "We have purchased these jeans for years. Lee.com gives us the opportunity to purchase all colors, sizes and styles for both men and women. It is the only jean my husband will wear.", "Very disappointed, I bought 3 pair of jeans. I wore the first pair one day and a belt loop broke. I bought Lee because I like the fit better, but Levis are much more robust.", "A great pair of jeans. Easy to order. Delivered fast. A size and color that is usually hard to find. This site helped save alot of time and trouble. Lee jeans fit and wear great.", "I placed two orders from Lee. The first order fits great. The second order was baggy in the rear. The only difference was the color ordered. Other than that, I usually purchase the Lee brand jeans", "I am over forty and tried other Jean brands over the years. But I always come back to Lee Jeans. They have always been the best for fit, comfort and service. I am a Lee brand believer for life.", "Consistency in fit and quality are the two characteristics that I enjoy when I purchase Lee Jeans. There is one thing I would like to see and that is lengths available for people my size(27/28 in.). Other than that, I love my Lee jeans. Thanks. Len", "i just got my order in, and I must say that they are a great pair of jeans. The sizing was what I ordered. The fit was right on. Very soft but very strong jeans.", "This jeans is not regular fit!! It's slim fit!!! I'm confused why Lee's regular fit jeans is so tight. My jeans is totally not the same as the one on the graph, though the brand on the jeans shows that it is the same style.", "I really enjoy to 2 pair of jean I just bought on-line. It is hard to find any locally in 29 inseam. Really enjoy the color of each and that great Lee fit!", "Bought for my husband, ordered, did not fit, ordered again, did not fit, waiting for the 3rd pair, if these do not fit, that's it, will not try these again...", "These jeans are a great value and the fit is terrific. My only complaint is that the length was longer than it was marked. It was supposed to be 32\" but in fact was 33 1/2\".", "Perfect for my picky husband. He loves the new colors. I got the beige and the grey. He now has shirts to match different jeans. I love this too. Perfect fit and size. Getting a length of 29 \" is so hard to get in stores.", "they don't fit. very disappointed with these jeans ! bring back the \"old\" style design, fit , and cut. I will not buy these jeans again! you lost a long time customer!", "I had to order online to find the right pair. My son gave me a pair for a holiday and the fit was great. I searched and purchased other Lee jeans but only this catalog number would fit like I wanted.", "With all of the different options available it's been very difficult to find the right jean with the right fit. Lee makes me feel good about owning a pair of jeans again. Thanks you Lee Jeans.", "One of the two Jeans received was defective, the stitch was not straight and the color around it was not uniform, this is not the Quality I expected from LEE.", "It's a real man's jean. Great fit and feel, a wonderful selection of colors and most important all the sizes. I used to live with Levis but Lee has won me over. Keep making quality jeans at an affordable price and you will always have customers!"], "reviewed_date": ["October 13, 2009", "November 26, 2011", "August 1, 2010", "September 11, 2010", "March 17, 2013", "June 30, 2009", "October 6, 2010", "November 18, 2009", "March 31, 2010", "December 13, 2010", "September 26, 2011", "February 24, 2010", "May 12, 2012", "November 5, 2011", "January 3, 2018", "May 8, 2016", "October 10, 2010", "October 13, 2009", "January 13, 2010", "July 15, 2013"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["landho, ", "clubmaker, ", "rats, ", "Pudit, ", "al, ", "AREJAY, ", "ohionogranny, ", "StillSlim55, ", "dark, ", "Awesome Ed, ", "aruba224, ", "DebbieC, ", "johnnifer, ", "Coach, ", "Vlyman, ", "greybeard, ", "calace, ", "jhf2447, ", "kuk, ", "hkjag, "], "reviewer_rating": ["5", "3", "2", "5", "4", "5", "5", "4", "5", "5", "5", "5", "4", "5", "5", "5", "5", "3", "1", "5"], "reviewer_headline": ["Well Done", "style change", "too loose", "Best value, fit and style", "Regular Fit Jeans", "BEST JEANS", "great jeans", "Shorter rise / smaller seat.", "Great Jeans", "I will be buying again !!", "Regular Fit Straight Leg Jean", "These actually fit in the", "2 excellant - one wrong", "The Best", "Best", "Not Quite", "great deal great jeans", "Not the same", "don't know if i would buy these jeans again", "great jeans"], "reviewer_comment": ["I was very impressed with the speed with which my order arrived. I ordered on a weekend, and Mon.was a holiday, and my order arrived in three days. Great job. The fit is great and I like the color", "After all these years Lee has decided to change the fit of their regular fit jeans. They have made them baggier in the seat and thighs. They already have relaxed fit jeans for those who need or like them. Why change a style I have worn for 10 yrs", "these jeans used to fit great (I'm skinny)...but it seems you \"relaxed\" them. I can get relaxed stuff all over town. I was depending on you for stuff that fit good.", "My husband loves these jeans. They fit perfectly. They look great and are very comfortable. I like the value. We will buy more because they come in many colors.", "Have bought a few of these sizes vary between colors bought 30\" length they measured 28\" sent back next pair measured 28\" cancelled order they need better quality control otherwise nice jeans--P.S. there regular fit shorts are outstanding---", "ALWAYS LEARY OF BUYING CLOTHES ON LINE. BUT THIS WAS A GOOD EXPERIANCE. THE JEANS CAME IN A REASONABLE AMOUNT OF TIME AND FIT GREAT. ALSO LIKE THE COLOR..ALREADY PLACED A SECOND ORDER", "bought 2 pr. of the dark stone wash jeans for my husband who is really skinny and has trouble finding jeans that fit his skinny frame. These jeans look great on him !! I will be ordering several more prs. in the coming month.", "I like the Lee fit with a shorter rise and smaller seat than typical jeans, so they don't bag down on me. Too bad they aren't made in USA anymore, or I'd wear them exclusively.", "Good fit every time, wears well, and like the many choices of colors to choose from. Only wish they would offer a trim fit for us men who have no butts.", "Jeans are perfect , I work retail and they look great and feel comfortable all day . Fit perfectly around my waist thanks to the fact they stretch and I was able to order them in the size length i need. I am very pleased .", "As always great fit. Would like if the LEE patch on back of jeans would be like a belt loop like it use to be!! Makes for good advertising too!! Now it's covered by the belt.", "These actually fit in the rear end were must other jeans do not they are really baggie but not lee. Finally someone who understands people with no butts.", "2 pairs of the jeans were marked 36 x 32 and they were 36 x 32 -- the other pair was markked 36 x 32 , but when measured they were in fact 38 x 32 -- 19'' across the waist -- don' t know what to do with them ??????????", "This is my second pair of Lee regular fit straight leg jeans. They fit perfectly, look great (even my wife agrees) and have maintained the same fit after washing. They are the only jean I will buy from now on.", "These are the best fitting jeans I have found. Tried lots of different brands and they are much too baggy. I don't consider myself either large or small body.", "Have been wearing Lee jeans for a long time-Bought two pairs exactly the same size and style but one pair was a little bit shorter and tighter-and the pockets seem a little shorter than before-Still my favorites though.", "Love these jeans for my husband because they come in a 29 length - hard to find in stores. Fantastic on line price - cheaper than all the other stores. Would definitely buy here again.", "I purchased 2 pair of these same jeans last year and they fit fine. The ones I received now do not fit like the old ones. Waist seems to be 1-2 inchs smaller. Will be returning them. Ordered same size and style.", "I don't know why you resized the regular fit jeans, been buying them for 40 years and the new sizing sucks. you already have loose fit jeans for the people that like that fit. Very Disapointed in the fit", "Lee manufacures a great jean. They are very durable and the longer they are worn the better they look. There is one improvement that Lee needs to make. Add a jean with 28\" length."], "reviewed_date": ["February 28, 2010", "September 28, 2011", "May 29, 2012", "March 28, 2010", "August 21, 2017", "December 25, 2011", "October 5, 2012", "April 14, 2009", "July 7, 2012", "March 3, 2018", "March 11, 2013", "July 17, 2012", "October 5, 2010", "May 26, 2010", "April 15, 2009", "December 18, 2009", "June 17, 2012", "June 29, 2013", "August 5, 2016", "November 23, 2009"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["dissapointed, ", "indy, ", "wezshootn, ", "KDAfromNC, ", "Ted, ", "cleep63, ", "wtwister, ", "happycamper, ", "BlueJay, ", "cassie, ", "sthomas0616, ", "spitfire, ", "dnmlns, ", "Jack, ", "Angelo, ", "FrBird, ", "jahoody, ", "Chuck, ", "ktowngirl, ", "raw1832, "], "reviewer_rating": ["1", "4", "5", "5", "5", "4", "3", "5", "5", "4", "4", "3", "5", "5", "5", "5", "5", "5", "5", "5"], "reviewer_headline": ["What is going on", "Lee Jeans - my choice for 25+ yrs", "Latest Order Review ...", "fast and great quality", "Lee Men's Regular fit straight leg", "good jeans", "Regular Lee Jeans", "love these jeans", "Fit right", "reg. straight leg jeans", "Nice Fit, Good price", "Bad zippers", "lee jeans are better than levis", "Fit Just Right & Very Comfortable", "I been were Lee Jean for", "Great jeans", "best quality for the price", "Long ,Long ago...", "Best fitting jeans", "Great Value"], "reviewer_comment": ["I have been wearing the same Lee jeans for forty years. All of a sudden my authentic jeans are thinner in material and a differant fit. Stop using someone other than authentic to make my jeans.", "The \"LEE\" fit has been my choice for over 25 years. Fit and quality have always been a consistent. I do miss the \"classic stone\" color - wish it were still available.", "5 out of 5 total winners for fit and comfort. 1 stitching at bottom of zipper a little loose ... might come unraveled but will wait and see Two Thumbs Up for this order overall. :)", "The shipment was fast, the product is of good quality material. My husband wore that other popular brand for 40 years until they discontinued his size. Your regualar fit Jean was a perfect replacement for 1/2 the price. Thanks Lee", "I was a Levi's loyalist for decades. I STILL like them. About a month ago, for some reason, I tried a pair of Lee's. I found they fit me better AND that they felt more comfortable. Today I bought three more pair. Give them a try!", "I love the jeans, 40 waist 34 in seam, However as regular fit they shrunk just a tad more than I thought next time I might get relaxed fit jeans. Or maybe I need to shrink some, Thanks - Lee : )", "I purchased two pair of the same size jeans. One pair fit great and was true to size. The other pair was about 3/4\" smaller in the waist and fit tight. Great jeans at a good price if you are lucky enough to get the right fit.", "fact is, I've worn 'em every day since they showed up, and I've never been happier with a clothes purchase. They fit to a tee, and get more comfortable every day. Lee rocks!", "As usual these Lee Regular fit jeans fit better and are more comfortable than any other jean brand I have ever tried and they are certainly the best value. Not all colors are available however, and so-called \"premium jeans\" are not defined.", "29\" inseam is still quite generous, actually measures close to 30\". Unfortunate that 28\" inseam isnt an option. will be getting the jeans shortened. overrall experience 4 Stars!!", "was basically looking for another type of jean but discovered these, bought them and am very happy with my selection. I'd like to see more of the jeans in different colors though.", "The zippers in all of my newest Lee jeans are of very low quality. I have been buying Lee's for years because of the great quality and fit. Please improve on the zippers.", "Growing up i picked a brand and ran with it which was levis, but as time went by i noticed they were getting progressively cheaper in quality.Just last year i said enough and switched to lee jeans, all i can say is, \"i wish i had switched sooner\"", "I keep coming back to Lee mostly because 29\" length is so very difficult to find in jeans. Would only request that those colors which are sold out in that length be replenished.", "I been were Lee Jean for many years, and I would recommed them to everybody. There the only one that fit me great, and bek=live me I have tryed other brands.", "I've been wearing Lee Jeans since my 16th trip around the Sun. I completed my 58th trip in January. The low rise works well for my body shape. They're comfortable, tough and affordable.", "HEAVY weight denim is hard to find in stores and my hardworking guy needs the extra strength it gives him. And your product does NOT shrink or change shape as some others do.", "My mom bought me my first pair of LEE Dungarees, I was 5 years old and 57 years later I still wear them and will till the end. Thankyou Lee and company your the Best !!", "The only jeans my husband will wear. He hates baggy jeans and these fit really well. Love the assortment of colors and the offer of free shipping is great.", "The fit is excellent, the quality rivals any jean made, the price is a bargain. The fit was true to size, the exact same as Levi, I have a new \"go to\" Jean, I will buy more, won't wear anything else."], "reviewed_date": ["May 1, 2011", "August 1, 2011", "December 20, 2009", "July 2, 2011", "April 20, 2016", "December 28, 2009", "December 29, 2009", "December 18, 2009", "April 29, 2013", "April 24, 2011", "April 14, 2009", "April 28, 2009", "December 5, 2009", "December 3, 2017", "February 11, 2012", "April 14, 2009", "July 6, 2010", "February 21, 2019", "November 20, 2010", "February 5, 2011"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["spara, ", "LOGGER64, ", "CyraB, ", "nuthuthoney, ", "Mafatu, ", "mugzmo, ", "Chelsea, ", "nolan, ", "QUIRK, ", "steveoso, ", "Richsi, ", "TheyFitWell, ", "4value, ", "hillwitch, ", "Befit, ", "SonGodRAH, ", "chinsugars43, ", "PowerRon, ", "zeldogill, ", "slick, "], "reviewer_rating": ["1", "5", "4", "4", "5", "5", "5", "4", "5", "5", "5", "5", "5", "5", "5", "4", "4", "5", "5", "5"], "reviewer_headline": ["inconsistent", "Awesome Jeans", "Great jeans, best for the slim", "Best fitting Jeans for me.", "Great Fit and a Great Value...my favorite jeans to wear", "Great jeans", "Best Fitting Jeans", "jeans", "REAL JEANS", "Good fit and quality", "Good Everyday Jeans", "Fit Well", "Excellent Jeans", "Love the Jeans/Not the length", "Great Jeanss", "Everything you want out o", "Good buy", "The only jeans to buy", "great jeans", "jeans"], "reviewer_comment": ["I'm not sure why but its becoming impossible to receive one pair of jeans that fit, they get baggier with every shipment, I used to be able to keep 2 out of 3 pairs, I've returned the last 5 pairs \" too loose\" bring back the consistency you once had", "Been looking for these everywhere for the right price and finally found them. These are the best fitting jeans that I've ever wore. Lee Jeans are the longest lasting, most comfortable, and my favorite of all the other ones I have. Thank You.", "This are not tight, but a little narrow in the thigh, making them less comfortable on my son than relaxed. But they're really nice and well cut, otherwise.", "The only problem I encountered is with the button above the fly. I don't think the hole to put the button in is quite big enough. It's tough to button!!", "I selected the Ringer color and it looks great with just about everything. I love the fit and comfort. The 12 oz jeans material is just the right weight...not to heavy and not to light.", "I bought these for my teen son who is very tall and thin. It's great to find jeans that are slim and long enough for his frame and cool enough to wear. Very satisfied.", "My brother is short and has a hard time finding jeans that fit. Lee jeans fit the bill with shorter lengths and slim legs. Would like to see 28 inch inseams.", "I'M DISAPOINTED THAT THE LEE TAG IS STICHED ALL THE WAY AROUND. I LIKE THE OLD WHERE YOU COULD PASS YOUR BELT THROUGH IT. WHATS UP WITH THAT ???", "FORGET WRANGLER OR LEVIS THESE ARE REAL JEANS. NOTHING LEFT OUT. CAN'T BEAT THE FIT, THE PRICE, OR THE ONLINE EASE OF ORDERING.", "Lee makes a very good quality jean. The denim is heavy and lasts a long time. I personally like the colored jeans and wear them daily.", "Good fit, only jeans to have a 28\" length no other company has this size! Only con is this size is only in one color (bummer)", "Lee Jeans speak for themselves. I would like to take the time to say that the overall process of my purchase was fast and easy.", "These jeans are one of the best I have bought. They feel comfortable and look great! Can't say more!!!!", "I love Lee Jeans but really wish you would make a 28 inch inseam or even a 29 inseam would be great. Thank You", "Really wasn't sure about the color when I ordered, but loved it when I saw it. The fit was great, cannot wait to order some more.", "Everything you want out of a pair of blue jeans and in addition they are an excellent value for the money", "Well made. Like the color. One complaint is that you no longer make a jean with a 31\" inseam. Is perfect for me.", "I have tried other jeans and always come back to Lee. The Lee jeans provide the best fit, high quality, and are a great value.", "i always get exactly what i want from lee.com. nobody in town carries the full selection of items so i always buy from lee.com and delivery is quick", "lee jeans fit better then all other jeans and wear very well. price beats all other jeans .. on line purchase was simple and shipping was fast."], "reviewed_date": ["May 29, 2016", "February 27, 2013", "April 2, 2010", "July 29, 2012", "August 13, 2018", "November 5, 2011", "November 14, 2010", "March 17, 2013", "January 2, 2010", "April 18, 2009", "October 13, 2009", "January 17, 2010", "February 4, 2012", "October 15, 2009", "March 2, 2010", "September 20, 2010", "November 27, 2012", "October 13, 2009", "April 29, 2013", "June 12, 2012"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["mandelm, ", "Raul, ", "Pete, ", "sissid, ", "tlaur, ", "crane, ", "dekid, ", "Jenny, ", "Husband's buyer, ", "bill3692129, ", "Edlee, ", "golfguy, ", "Bob, ", "Wambleyburger, ", "swtrading7, ", "Jerrylms, ", "Reggie, ", "TheRogue1000, ", "mkraus63, ", "Itch, "], "reviewer_rating": ["5", "5", "5", "4", "4", "5", "5", "5", "4", "5", "5", "5", "5", "5", "4", "5", "5", "4", "5", "5"], "reviewer_headline": ["Great pants for a great value", "Long time Lee wearer", "REGULAR FIT STRAIGHT LEG JEANS", "Lee Jeans", "Nice Men's Jeans", "Need Another Color", "Love the jeans", "Love the fit", "Loose fitting but great quality", "LEE JEANS FIT", "Top Shelf! Just what I expected.", "of course..my jeans", "Return Customer", "Excellent!!", "Comfortable fit", "My Fav Jeans!", "Finally found right size!", "Good, but....", "Jeans", "Lee Standards"], "reviewer_comment": ["The pants were purchased for my husband, and they could not have been more gleefully received than if Santa brought them himself.", "I used to wear Levis, but Lees fit me much better, last longer, and look better. I just made my first order online and got great service.", "Great value. Excellent product. Delivered on time. Wonderful overall experience buying and wearing Lee Jeans.", "Jeans fit fine except they were not the same as previously purchase in retail. Would like to find same style number.", "Nice jeans with the only drawback being a zipper that is shorter than it is in other jeans. Otherwise, I like the look and price. Thanks.", "I like the regular fit jeans. My size is 36W x 36L. I prefer the light stone color, but it is not available in regular fit in my size.", "Love this style. Been wearing them for years. Feel good in them and still makes me look good in them. Ladies love me in them.", "I bought my husband 2 pairs of the straight leg jeans and I love the way they fit him. After seeing how terrific they look I bought 2 more.", "Usually buy another brand, but these are comparable in value and quality. Other brand fits perfectly; these were a little more relaxed.", "By and large an excellent fit. Just a little loose in the waist, but that is my issue. If they were available in uneven sizes, all would be great.", "It was great to find what I needed online. Was getting frustrated not being able to find the jeans I wanted.", "I've worn Lee jeans for over 50 years,and have them on as we speak. I'm at my best when I'm dressed comfortably ,as I am right now.", "Good product. Have been buying for years. And, of significant importance, they have the 29\" inseam I require.", "Easy online transaction. Fast shipping. Fantastic fit. Product quality goes without saying. An overall excellent buying experience. Thank you.", "These jeans are soft and always have a comfortable fit. Unlike most standard jeans that take many washes to remove the stiffness.", "There just are no jeans that fit this good anywhere else. I'd call this the clasic \"low rise\" jeans.", "Love the fit and the price was right. Best of all the size I need is rarely found in any local store. Good to know I can find them with you on-line!", "I got the darker colour and the colour ran in the washer, destroying a lovely polo shirt. First time I've ever had a pair of Lee jeans do that.", "These are the only jeans that I have found that are true to the indicated sizing and fit. Why buy anything else?", "As usual, the men's Lee Jeans Regular Fit straight leg meet our standards. Also, available in hard to find length 29."], "reviewed_date": ["January 20, 2012", "November 21, 2009", "April 14, 2018", "June 1, 2010", "April 15, 2009", "January 1, 2013", "November 18, 2009", "December 9, 2010", "May 21, 2016", "April 15, 2009", "April 16, 2013", "April 14, 2009", "December 11, 2017", "April 11, 2011", "July 23, 2011", "March 9, 2010", "December 30, 2009", "September 3, 2011", "December 19, 2009", "July 30, 2011"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["dsalem23, ", "NavyITC, ", "unclero, ", "StillLooking, ", "Phillip, ", "WaltD, ", "pipere, ", "crashapan, ", "Russ, ", "finn, ", "KJReal, ", "Hunter0851, ", "dmhvict, ", "see2doug, ", "bare1941, ", "delighted, ", "flasue, ", "Patrick, ", "fredd, ", "epie, "], "reviewer_rating": ["5", "5", "4", "3", "5", "5", "3", "5", "5", "5", "4", "5", "4", "5", "5", "5", "5", "5", "4", "5"], "reviewer_headline": ["great jeans", "Loyal Customer!", "daily standard", "Poor Color", "Regular fit Straight Leg Jeans", "Perfect Fit!", "off color remark", "Jeans", "Great Jeans", "Improved", "Great Jeans - But", "They fit", "Men's Lee Jean Sizes...", "Quality Jeans", "Best fitting jeans", "Lee jeans are the best!", "best fitting jeans", "best fitting jeans", "I always kept several sma", "best fitting jeans"], "reviewer_comment": ["I've been buying Levi's for years and can't believe I've wasted all that money. I find lee fits better and seems heavier. love em.", "Bought and worn these jeans for years - they cannot be beaten for quality and value. No fancy designer label... for which my wallet says thank you!", "these are my third pair that I have purchased, all fairly recently. I wear them as my daily jeans and love the fit, material, and style.", "The color as it appears on the web is different than the color that arrived. Would not have bought them had I seen the real colors.", "The jeans are very comfortable and the quality is outstanding. The jeans are very stylish and the price was very reasonable......!", "Quality, fit, ease of ordering and delivery were all perfect! Better than going to a department store!", "waist correct,length correct,great overall fit. the color tarmac is shipped more green than the tan as depicted.", "Love Lee Jeans, fit, comfort and value unsurpassed. Wish you would bring back the light gray color though and maybe introduce a charcoal gray color.", "I've purchased these before. Always fit perfect. Great quality. Love getting them on line. No searching through stacks at a department store.", "Lee jeans has improved the jeans. the last purchase a few years back had a lot of problems. jeans fit better, wider watch pocket and etc.", "These jeans are great but the color was not what I thought I ordered. Other than that, I don't have any problems with them", "I always buy Lee jeans because they fit the same every time. The price was right. The quality is very good.", "Love Lee Jeans; unfortunately the 35X30 is only available in a blue or black. I wish Lee carried it in a tan, khaki,brown, and green. Too bad......", "Great for casual and leisure wear. Great quality material that lasts for a long time. Size ran smaller than other jeans.", "I've been wearing Lee Regular Fit Straight Leg jeans for about 22 years and have always loved the fit. Thanks for a great product.", "I have loved Lee jeans for years due to the heavy denim, long wear, great fit and comfort. Would recommend them to anyone. Wonderful product.", "This is the only jeans my husband will where. He says they are the only ones that fits him properly.", "Great fit, great color, web site was great, gave the specifications so I knew what I was ordering. Just ordered 2 more pair.", "I always kept several small things in the watchpocket but now they have shrunk the watch pocket so much it is no longer useful. Grumble, grumble.", "sand color jeans are excellent. Inow own 12 pars of Lee jeans in 2homes. Please add whie jeans regular fir to your offerings"], "reviewed_date": ["December 25, 2012", "November 5, 2011", "June 8, 2010", "November 28, 2011", "March 31, 2010", "June 11, 2012", "November 17, 2010", "October 14, 2009", "June 22, 2010", "September 29, 2013", "May 30, 2011", "April 11, 2018", "August 7, 2011", "January 19, 2011", "March 5, 2011", "February 26, 2013", "December 18, 2012", "March 15, 2014", "January 25, 2011", "January 13, 2011"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Yorkie, ", "cubnutz, ", "ostgeorge9303, ", "Pepere, ", "tiptop, ", "Putterpop, ", "jeanman12, ", "Ryan, ", "jschw, ", "TexasDave, ", "bkdp, ", "jeansunny, ", "reborn902, ", "rngrssuk, ", "leeman10, ", "CSIMENETA, ", "Lenny, ", "Grace443, ", "Stratman, ", "tallcuss, "], "reviewer_rating": ["5", "2", "5", "5", "5", "1", "5", "5", "3", "4", "5", "5", "5", "5", "5", "2", "5", "3", "5", "4"], "reviewer_headline": ["The only jeans my husband wears", "wrong color", "My Jeans", "Lee Jeans", "LEE JEANS ARE \"HIP\"", "Balck Jeans", "Great deal", "Comfortable Fit", "Fit Differs", "Excellent Fit", "Fit is good", "good", "Thanks again Lee !!!", "Best fitting jeans", "The Jean That Fits", "Jeans were tight fitting", "One of the few jean companies that have 29 length jeans", "The zipper covering doesn", "Best Fitting Jeans", "My jeans"], "reviewer_comment": ["My husband wears these jeans every day of the week for as long as I can remember. They are durable, look great and affordable.", "I ordered the pants in DUNE color which is tan the color that came was a very yellowy brown very disappointed", "It was easy to find my right size and color. The service was fast and exactly what I was looking for", "ordered my lee jeans on line since the local stores don't carry my size and they arrived in excellent shape and fit perfectly.", "I own over 20 pairs of LEE Jeans is every color available. The fit is FABULOUS - I wear LEE Jeans exclusively. Please add more colors (Olive Green) .", "Donning for the first time: Great!!! After washing: I must have gained a ton of weight in the few days worn. Didn't fit well. Major shrinkage!!!", "Always have bought Lee Jeans, but this was my 1st time ordering online....very easy and convienient....", "I especially like the fact that the jeans I ordered come in a 28 inch length which is perfect for me. I am only comfortable in Lee jeans.", "I ordered these jeans twice in the past two months, same waist size, same inseam.Yet, the fit on each pair is significantly different", "Best fitting jeans I've worn for many years; just wish the fabric was not as stressed, particularly the dune color.", "Fit was good. Bought two different colors and one was slightly smaller than the other but within apparel standards. Well made and comfortable.", "the price is good ,and the \" Regular Fit Straight Leg Jean\" is nice to us . also shipping is fast. I will buy others .", "As usual, these jeans fit great and what I like best is that I can get a shorter inseam here than I can in the stores.", "These jeans are the best fitting most comfortable jeans I have ever had. And least expensive as well", "Lee is the best value and best fitting jean in the marketplace. I know this because I spent 20 years selling them.", "For a men's jean, in my opinion, these were too tight fitting and too tapered at the leg. I had to send them back because they looked goofy.", "So happy to find 29 length Jeans that look great and are very comfortable. Ordered 3 pairs and one is noticeably longer than the others though.", "The zipper covering doesn't lay properly. It could be the inferior sewing. My husband doesn't like them but we kept them.", "Easy to shop for and find the exact color and size you need. Lee jeans have the most consistent and best fit of any I've worn.", "I'm 6'4\" and finding jeans to fit can be difficult. Lee.com solves the problem nicely. They have the best selection, and are good quality and value."], "reviewed_date": ["September 6, 2010", "January 15, 2012", "August 23, 2010", "November 18, 2009", "March 31, 2010", "January 10, 2012", "October 16, 2010", "June 30, 2009", "November 20, 2012", "January 23, 2012", "November 18, 2012", "June 21, 2011", "December 12, 2010", "November 26, 2012", "October 9, 2011", "January 18, 2011", "January 10, 2018", "March 4, 2012", "June 15, 2010", "July 5, 2009"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["googlegal, ", "BandB, ", "ALPOSN, ", "daci, ", "odinsdad, ", "Wind, ", "dadarter, ", "gates, ", "justwearjeans, ", "sdavis1135, ", "vicrob, ", "sherman, ", "Jack Wells, ", "shockman, ", "zkat, ", "Hank74, ", "Power2, ", "garsbarr, ", "TomThum, ", "davesl8, "], "reviewer_rating": ["5", "5", "5", "5", "5", "5", "5", "4", "5", "5", "2", "5", "5", "5", "5", "5", "4", "5", "4", "4"], "reviewer_headline": ["excellent product!!", "Best fitting jeans", "Great Size Choices", "Great Service and Value", "Great fitting jeans", "He likes them the best!", "Best Fiting jeans", "nice feeling jeans", "finally gray", "great product", "Too small a fit", "the best", "Love these jeans", "GREAT FIT", "great jeans", "Bread and Butter jeans", "I would like them to be m", "Gary S Barr", "only LEE", "These Jeans are less expe"], "reviewer_comment": ["Great value and fit as well. They have served me well for years and always have a consistent fit and construction.", "Seem always to come back to this original style for good fit and durability. I prefer the midweight denim for Florida weather.", "These fit great and it's about time someone has started making those in between sizes for adults. I need a 35 waist, not 34 not 36.", "Received in 3 days. Only I agree with a previous reviewer that the colors shown on your order site are not accurate at all!", "All of the great fit and quality of Lee with the colors to wear all the time---when demin isn't appropriate", "These are the jeans that my husband likes the best. He always is happy when someone buys them for him.", "I love these jeans. I purchased 5 pairs for my husband. They fit him great and he says they are very comfy. I will definetly buy more for him.", "lee leans are good fitting and feel good when you wear them. they also are nice looking and really comfortable.", "I have been looking for gray denim jeans for about 5 years. finally I found them. GREAT but why call them battleship?", "My husband loves these jeans. The quality is first class, price is great, and the service is superb.", "I tried the loose fit and they were too baggy so I went for the regular fit. Way too tight. Fit differently than the double black ones.", "I have tried them all. Lee jeans regular straight fit are the best. they fit perfect . Don't chage a thing .", "I've been buying Lee's since the late '60s. The regular fit straight leg are perfect for my aging body!", "I HAVE REPLACED MY WRANGLERS WITH LEES JEANS. GREAT FIT AND LOOK GREAT. MORE COMFORTABLE THAN WRANGLERS AND LEVIS.", "Was just what I wanted, but these jeans that I ordered could be made of heavier material like the blue jeans. Otherwise they are perfect !!!!", "Great selection of colors. Good fitting basic jeans.", "I would like them to be made in 31\" inseam. This is a perfect fit for me.", "It is hard to find Jeans that have 35 inch waist size, they fit great.", "I have been wearing Lee jeans since high scholl, love the fit, comfort, durability and value.", "These Jeans are less expensive than other manufactures and seem to out wear other manufactures"], "reviewed_date": ["August 24, 2010", "April 26, 2010", "January 4, 2010", "January 2, 2012", "October 30, 2011", "December 28, 2009", "April 12, 2010", "September 9, 2012", "November 20, 2012", "June 23, 2010", "December 1, 2010", "May 1, 2013", "December 10, 2017", "April 11, 2013", "November 18, 2009", "May 1, 2009", "December 11, 2012", "November 18, 2009", "August 18, 2010", "February 14, 2011"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["soup, ", "bootsee, ", "2rich, ", "blackhawk41, ", "dennisofausttin, ", "watarush, ", "mobilemom, ", "laura, ", "pipermom, ", "ken7777777, ", "Frank, ", "JAS1, ", "Julian, ", "sas1, ", "rberger, ", "Puddycat, ", "MajorJGH, ", "Bo jangle, ", "LA35, ", "olderguy, "], "reviewer_rating": ["5", "5", "3", "5", "5", "5", "5", "5", "5", "4", "5", "4", "5", "5", "5", "5", "4", "5", "5", "4"], "reviewer_headline": ["please keep making 30X29", "best fitting jeans", "the leggs are too baggy c", "best jeans", "Luv them jeans", "best jeans around and the", "Great fit", "good fit", "Great fitting jeans", "fit", "Back with Lees", "Lee fits me", "Fits perfect", "Great Fitting Jeans", "great all around", "Never Change", "Regular Fit Straight Leg Jean", "Perfect work pants", "Fit is great.", "good value"], "reviewer_comment": ["please keep making 30X29 not all of us are wider than we are tall", "I have tried them all and this jean stands out as being a real good fit. you wont be sorry.", "the leggs are too baggy compared to the same style I bought two yearsago.", "best jeans ever at a great price", "I am now a permanent buy only Lee jeans guy....took only 61 years! Kids, pay attentiion.", "best jeans around and the price is great!", "Great jeans and good price.", "These jeans fit my husband very well. I was glad to find them on the internet.", "Good quality holds up well - good color holds thru many washes - great fit for my husband.", "Ordered jeans inb the past different material (color) these did not fit the same", "Great price, excellent fit, lightning fast shipping. I'm very happy with my purchase!", "People are fearfully and wonderfully made, but we're not all built the same. Lee fits me.", "Everything is OK, fit, style, comfort...", "Look great, Fit Great, Great value", "The service was great, and the product fits and looks great.", "These jeans are still the best fit. They have not changed with time and I hope they never do.", "I have bought many pairs of these regular fit straight leg Lee jeans. They are my favorites.", "I wear them to work in an office a few times a week", "Relatively rare to find 35 inch waist -- wish more colors and styles were available in 35 waist.", "Good value, but not the same fit and denim as older ones I purchased years ago"], "reviewed_date": ["November 22, 2011", "February 26, 2011", "April 16, 2012", "August 21, 2012", "April 23, 2011", "February 15, 2010", "March 2, 2010", "April 14, 2009", "October 13, 2009", "December 28, 2009", "May 18, 2011", "May 30, 2010", "December 18, 2013", "November 18, 2009", "November 9, 2012", "March 21, 2011", "May 5, 2012", "March 23, 2018", "April 26, 2011", "January 13, 2011"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Scootsmom, ", "COLJW, ", "SatisfiedinFW, ", "yankeedave, ", "gdogc, ", "slowpoke, ", "chief131, ", "LKaler, ", "lmiles9645, ", "fishfafun, ", "dnice14510, ", "Bag Outlet, ", "patr, ", "Tx1873, ", "rjmac, ", "Yooper, ", "baronvb, ", "Karen211, ", "fmazz, ", "walt, "], "reviewer_rating": ["5", "5", "5", "5", "4", "5", "5", "4", "5", "3", "5", "4", "5", "5", "5", "5", "5", "5", "5", "5"], "reviewer_headline": ["Nice looking", "Lee Jeans", "Good looking jeans", "basic jeans, just what I wanted", "Regular Fit straight jeans", "very pleased", "excellent fit", "Great Jeans", "Best fitting jeans", "seems fine but the color", "best fitting jeans", "The only jeans my son will wear.", "favorite jeans", "Regular Fit Straight Leg Jean", "just right", "Great fitting jeans", "Rugged Jeans", "Jeans are great. They are", "best fitting jeans", "great fitting jeans"], "reviewer_comment": ["Husband looks really nice in these and he loves the fit.", "Great Jeans They were as advertised i.e. size, color, & style. Lee jeans are my favorite.", "My new jeans fit me well. They are availabe in many colors.", "just good old fashioned jeans. fit was good, photos were accurate. no complaints here.", "Lee makes a comfortable well fitted jean for a good value price!", "Great experience with ordering, delivery, and fit of jeans.", "been buying these jeans since I was a teenager", "Very Comfortable, Geat Fit and stylish as well. Need more traditional fits.", "I love Lee jeans. They always fit good and last a long time.", "seems fine but the color (stonewash) is much darker fabric than the picture on the web site shows.", "the only company that comes close to my size", "My son does not like to wear jeans, it's great when we find a pair he's willing to wear.", "I have been buying these Lee jeans for years and and have never been disappointed.", "Great fit without sacrificing comfort, good price too!", "bought these for my 2 teenage sons. fit perfectly. they are both happy. i'm happy!", "Great fit Great price Great jeans Says it all .", "These jeans are rugged with a great fit. It is great to order direct and get the right size.", "Jeans are great. They are the only brand that fits my husband.", "The fit was great! Do you guys make 28\" inseam?", "The jeans are very comfortable, fit well and arrived very quickly."], "reviewed_date": ["January 29, 2014", "March 5, 2012", "November 18, 2012", "November 18, 2009", "January 24, 2012", "April 21, 2012", "May 8, 2012", "October 13, 2009", "December 18, 2009", "October 11, 2011", "October 15, 2011", "May 27, 2016", "January 20, 2013", "June 5, 2011", "December 21, 2011", "January 23, 2012", "November 18, 2009", "December 29, 2009", "March 14, 2011", "September 27, 2010"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["brownmass, ", "fastfreddy, ", "tbear329, ", "vike44, ", "bikerbabe, ", "writefielder, ", "johnmulberry, ", "Tstaff, ", "bishion, ", "Nicholai, ", "GettysburgHMS, ", "ybesaduryur, ", "pokey57, ", "rawdude, ", "jerseylee, ", "Lisztman, ", "medalynn, ", "Retiredguy, ", "mack, ", "steve, "], "reviewer_rating": ["5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5"], "reviewer_headline": ["best fitting jeans", "the only way they could b", "I always get a great fit", "Lee Straight Fit Jeans", "best fiting jeans", "fit great", "Perfect", "I would buy this product again and again", "Great jeans", "Great jeans", "Lee Jeans", "As Advertized", "Good Jeans", "very comfortable jeans th", "regular jeans", "Lee", "Incredible value", "Perfect", "First time I've tried Lee", "review"], "reviewer_comment": ["these jeans are great good fit good price", "the only way they could be any better would be a 28 inch inseam", "I always get a great fit buying from Lee Jeans.", "excellent jeans--fit perfect--not baggy--good body contour", "very quick service...received in a few days Husbands favorite jeans", "For slender guys like me, Lee's regular fit straight leg jean fits perfectly and offers comfort.", "Could not be happier. Exactly what I wanted and exactly what I got. Very prompt too.", "Great quality, great fit, great look. Can't recommend this product enough.", "I like it very much! It fit me very well. And I will buy other one soon.", "These jeans are well constructed and fit perfectly", "Great fit. Good choice of colors compared to 'just blue'. Prompt delivery", "The size and fit were perfect.", "These jeans fit comfortably look good on and do not cost an arm and a leg.", "very comfortable jeans that are tough material for working guys like me......", "great product and great value...please make them in the USA", "Half of price of a Levi's, quality - the same. Very pleased.", "These jeans are not only an incredible value, but also extremely well made.", "Perfect. Great fit, great color and fabric. Love Lee Jeans.", "First time I've tried Lee and they fit great, good quality and priced better than other brands", "just awesome!! the best!!"], "reviewed_date": ["May 17, 2015", "November 18, 2009", "November 5, 2011", "February 23, 2011", "June 25, 2012", "September 6, 2010", "February 24, 2010", "October 18, 2017", "December 24, 2011", "July 20, 2010", "January 18, 2011", "April 24, 2010", "September 29, 2010", "April 3, 2010", "February 19, 2014", "October 30, 2012", "December 18, 2009", "January 13, 2011", "November 19, 2009", "September 7, 2010"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["stan22, ", "bcizmarik, ", "DonBigote, ", "westielvr, ", "terry7, ", "traymond, ", "redcat, ", "CR, ", "Jimbob, ", "Great4Corners, ", "cwjjr61, ", "Sparky35, ", "petunia1965, ", "Peter, ", "Joe, ", "Chrisray, ", "dajc22, ", "ranwar, ", "tttt, ", "TomD70, "], "reviewer_rating": ["5", "5", "1", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "3", "5", "5", "5"], "reviewer_headline": ["Need more colors", "Great Jeans", "They are running too small", "Best Fitting jeans!", "lee jeans", "Great looking jeans", "Jeans fit good and look great", "Great fit.", "Great jeans", "Great", "Regular Fit Straight Leg Jean", "Good valuve", "Just Right", "Great all around jeans", "Purchased 3 pair for work", "Great fit", "nice material", "Perfect fit", "regular fit jeans", "Great jeans"], "reviewer_comment": ["Only problem i have is they dont have all the colors in all sizes.", "I have tried other jeans. Only Lee fits and feels comfortable.", "Compare to early purchases they run too small.", "Love the way these jeans fit and at a good price too!", "fits my husband perfectly. the colors were great", "Hi shipping was very fast and really like the look of the bronze washed jeans.", "I love my jeans and quick delivery I recommand Lee Jeans to everyone there great .", "Great fit. 35 inch waist is hard to find in the stores.", "The straight leg jeans have fit, style and great colors - my favorite jeans.", "This was the second pair for me. I bought the first pair this summer and they fit and look great.", "Love them, great fit, great value.", "Have been wearing Lee's and Wrangler jeans for years and years, always liked them, so why change.", "I bought these jeans for my husband. They fit very well. Especially pleased with 29\" length inseam.", "Great jeans for work and play.", "Perfect fit, excellent quality and value, very happy with jeans", "Great fit...great price. Love these jeans. Wear well", "Nice fitting except in length. I wish Lee would carry the shorter lengths for men.", "Exactly what I ordered, great value", "Great fit -very comfortable", "Great jeans. Strong and look good."], "reviewed_date": ["November 18, 2009", "March 29, 2010", "January 19, 2011", "March 7, 2010", "December 28, 2009", "January 10, 2010", "July 14, 2012", "November 22, 2017", "April 14, 2009", "October 10, 2011", "November 16, 2010", "November 23, 2010", "December 31, 2014", "September 12, 2010", "March 12, 2018", "July 6, 2010", "November 30, 2013", "January 13, 2011", "September 28, 2011", "June 26, 2012"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Ironia, ", "johnmac1952, ", "Doug, ", "MotoMan, ", "RocketJ, ", "REDRHONE, ", "peterb, ", "trophy, ", "raiddrank, ", "Mobetta, ", "Burka, ", "hismom, ", "AllenDB, ", "snakeskin54, ", "pat, ", "Nino, ", "Cummings, ", "sylvester, ", "Ron2010, ", "madmandom, "], "reviewer_rating": ["3", "5", "4", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "4", "5", "5", "5", "5", "1"], "reviewer_headline": ["A little too tight!", "Purchase", "Doug", "Great Fit", "Great Jeans", "THEY COME IN MULTIPAL COL", "best fitting jeans", "Regular fit jeans", "lee jeans", "Great Jeans", "Best fit", "perfect fit jeans", "Simple", "Regular fit straight leg jeans", "length of inseam", "Great fit and finish. Ver", "I'm happy with the LeeJea", "Lees", "Great fit, more selection", "not the same as they use to be"], "reviewer_comment": ["I will order a size up next time. 'the material was fine.", "Great price and extremely fast delivery.", "Xlnt, Fit, quality, wear. Took longer to get than stated, but worth the wait.", "These jeans offer a consistent good fit, are comfortable and come in a wide selection of colors.", "Great fit, great style, great value. What a great purchase looks like.", "THEY COME IN MULTIPAL COLORS.", "A lot easier to find what ineed shopping direct", "I've tried other brands and they do not come close to comparing to the fit I get with Lees.", "jeans fit perfectly - both waist and legnth.", "Shows very little wear after 1 year and 9 months!", "Very Good order processing.", "these jeans were a perfect fit and length; it's so hard to find 36L", "Gonna buy a few more pairs!!!! Can't beat the price.", "I got three pairs of these jeans,three different colors. All fit and look great!", "why can't you guys make a 28\" leg length for us short guys with a 42\" or 44\" waist????", "Great fit and finish. Very happy", "I'm happy with the LeeJean. Especially in the dark Brown (Walnut) color.", "great looking, great fit, and fast delivery. From now on, I will purchase all my Lee jeans on line", "Great fit, more selections than off the shelf in stores.", "I thought the jeans before they changed the style were better then what they offer now"], "reviewed_date": ["February 21, 2010", "July 6, 2010", "September 19, 2010", "September 25, 2011", "October 13, 2012", "April 14, 2009", "March 9, 2011", "February 26, 2016", "November 18, 2009", "August 4, 2010", "June 11, 2012", "April 3, 2011", "January 29, 2012", "May 29, 2012", "June 6, 2018", "March 5, 2012", "August 23, 2010", "January 23, 2010", "May 26, 2010", "October 2, 2016"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["michael15, ", "Voitek, ", "dwjohn6, ", "veggiegranny, ", "chinsugars, ", "carnut, ", "CollegeStudent, ", "leolee, ", "kanman, ", "MustangSally537, ", "yellowjacket, ", "sandyc, ", "whipdog, ", "merc, ", "littlealbuckeye, ", "Bookman, ", "allan, ", "onthecape, ", "superfundbob, ", "BigBlueToe, "], "reviewer_rating": ["5", "5", "5", "5", "5", "5", "2", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5"], "reviewer_headline": ["Good jeans", "Darn good jeans", "Best Jeans", "Very Pleased with Purchase", "Good fit", "good fit", "Wrong size, the waist is two size smaller", "A fit all of there own", "Great Jeans", "Best Fitting Jeans Good Value", "quality jeans", "Jean", "Lee Jeans Regular Fit", "great jeans", "Great Fit", "Regular Fit Straight Leg Jean", "best work jeans", "Great jeans", "Fashion and selection size great", "Lee Regular Jeans"], "reviewer_comment": ["I choose a dune color and it looks good.", "Good fit. Loved the color. Wish there were more color choices.", "Love my new Jeans they fit just perfect, Lee Jeans are the best.", "Fit is perfect and fabric weight is good too. I'm going to order a couple more.", "It is almost impossible to find jeans with a 31 inch inseam. These jeans fit me perfectly !", "These are the only jeans that don't fall off me.", "I order two pair of 31/30, however, the size apparently were 29/30.....", "The beat fit and, quality that is the best for me.", "Fit is perfect, great quality.", "Great price, fast shipping. Perfect fit.", "The delivery time was quick and fit was perfect. Best jeans on the market.", "Het, what can I say......they are jeans and they fit.", "These are the best fitiing jeans....the only ones that fit me just right and very confortable !", "great jeans, good fit and price, been wearing Lee 30 plus years", "These are the only jeans that fit me properly!! Love them!!", "Excellent Quality, Excellent Fit, Great Price, Website is Fantastic!", "Fit great,easy to work in, and they make you look like your ready for Saturday night.", "These are the only jeans my husband wants--he loves them!", "Best I've seen with waist size, leg lengths and fashion selection options", "They fit great. They're a good value. Since I found Lee jeans I've stopped buying other brands."], "reviewed_date": ["January 7, 2012", "June 18, 2012", "March 13, 2011", "April 13, 2011", "March 7, 2010", "December 30, 2009", "November 14, 2012", "April 15, 2009", "October 18, 2011", "November 14, 2010", "November 22, 2009", "April 14, 2009", "April 5, 2011", "October 13, 2009", "August 24, 2013", "July 4, 2012", "July 5, 2011", "November 2, 2013", "September 22, 2010", "March 14, 2010"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["LisaH, ", "Xavier, ", "Fred, ", "Larry r, ", "dawn623, ", "Mr  Ed, ", "marshallfan, ", "JJ, ", "LeeRider, ", "afrescu, ", "Robusto53, ", "Ray1952, ", "beniv, ", "ChicagoBob, ", "CatindeChilapa, ", "garyu203, ", "Lunch lady, ", "lc1sn, ", "billkni, ", "Bowenwork, "], "reviewer_rating": ["1", "5", "5", "5", "5", "5", "2", "4", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5"], "reviewer_headline": ["Sized small!", "Fit", "Great Fit", "A great option!", "perfect fit", "I do like Lee jeans and will buy them again.", "a waste of money", "I have worn this style for years and will continue to do so.", "It Fits Me", "Lee Straight Leg Jeans", "noe", "Love my jeans", "Great", "Best jeans", "Best Jeans", "BEST", "They are for my husband and he loves them.", "finally the right size", "great value", "Lee Jeans"], "reviewer_comment": ["My son is the same size in every other brand, but the Lee jeans I ordered him were way too small.", "Best fitting jeans I have ever found anywhere, ever.", "Lee jeans always seem to have the best fit...and they wear well much longer than other brands.", "Nice to get my fit right and color is true to the pictures", "Excellent quality. Very good & fast service. Will buy again.", "They fit great and sizes are consistantly the same.", "Priced right, but, too short (I measured the length vs label). Light weight fabric. Not for me.", "Great feel, wear them everyday.", "I have been a Lee Jeans fan for 30 years. The jeans fit me better then others.", "Outstanding product and value", "Lee are my favorite jeans. They fit right and look good.", "The best jeans ever. Just wish they had 28 inch inseams", "These are the best deal in the jeans market. Better fit, better quality, better price.", "Great fit, Sits at the waist and size was right on. Can't go wrong !!", "I will make the review short... I Love Lee Jeans over any other brand !!!", "What can a person say? If you ever wore Lee Jeans. You know, they`re the very BEST.", "My husband is very happy with the jeans", "finally was able to buy the right size. Very few stores carry size 33/29. Thanks", "perfect fit and stylish. well worth the price.", "Great fitting and comfortable weight of fabric."], "reviewed_date": ["January 2, 2012", "March 23, 2010", "April 11, 2010", "April 15, 2018", "October 27, 2010", "April 15, 2018", "April 23, 2013", "May 5, 2016", "January 18, 2011", "January 19, 2010", "December 31, 2015", "April 23, 2014", "December 12, 2015", "November 15, 2010", "December 19, 2012", "December 28, 2009", "December 29, 2017", "October 27, 2010", "February 2, 2010", "January 25, 2012"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]},
{"reviewer_name": ["Diamond08, ", "Mike, ", "JKAK, ", "Bob1, ", "e2223, ", "Pella, ", "JohnD, ", "Sparky35, ", "superfundbob, ", "cwjjr61, ", "Peter, ", "Mr  Ed, ", "Ray1952, "], "reviewer_rating": ["5", "5", "5", "1", "4", "5", "5", "5", "5", "5", "5", "5", "5"], "reviewer_headline": ["Best Jeans", "Customer Service really was excellent", "Nice jeans", "Regular fit straight leg jean", "very good jeans", "great fit", "Great Jeans", "Good valuve", "Fashion and selection size great", "Regular Fit Straight Leg Jean", "Great all around jeans", "I do like Lee jeans and will buy them again.", "Love my jeans"], "reviewer_comment": ["Its a best fitting jeans", "The jeans fit perfectly.", "great fitting", "Baggy, look sloppy", "Good quality, color, fit", "great fit", "Great Jeans, good price.", "Have been wearing Lee's and Wrangler jeans for years and years, always liked them, so why change.", "Best I've seen with waist size, leg lengths and fashion selection options", "Love them, great fit, great value.", "Great jeans for work and play.", "They fit great and sizes are consistantly the same.", "The best jeans ever. Just wish they had 28 inch inseams"], "reviewed_date": ["January 25, 2011", "December 23, 2017", "October 14, 2009", "September 8, 2010", "June 30, 2009", "December 31, 2009", "February 27, 2010", "November 23, 2010", "September 22, 2010", "November 16, 2010", "September 12, 2010", "April 15, 2018", "April 23, 2014"], "reviewes_likes": ["0", "0", "0", "0", "0", "0", "0", "3", "1", "0", "0", "0", "0"], "reviewes_disslikes": ["0", "0", "0", "0", "0", "0", "0", "11", "2", "1", "1", "1", "1"], "product_name": "Pacific Foods Organic Bone Broth, Turkey, 32 fl oz", "product_price": ["5", "68"], "product_rating": "4.4", "product_no_rating": ["5 stars", "550", "4 stars", "119", "3 stars", "47", "2 stars", "36", "1 star", "35"]}
]